In [10]:
import glob
import pandas as pd
from sqlalchemy import create_engine, MetaData

In [2]:
# Create sql engine
engine = create_engine('sqlite:///parch_and_posey.db')

In [3]:
accounts = pd.read_csv('pp_accounts.txt', sep='\t')
accounts.head()

,id,name,website,lat,long,primary_poc,sales_rep_id
0,1001,Walmart,www.walmart.com,40.238496,-75.103297,Tamara Tuma,321500
1,1011,Exxon Mobil,www.exxonmobil.com,41.169156,-73.849374,Sung Shields,321510
2,1021,Apple,www.apple.com,42.290495,-76.084009,Jodee Lupo,321520
3,1031,Berkshire Hathaway,www.berkshirehathaway.com,40.949021,-75.763898,Serafina Banda,321530
4,1041,McKesson,www.mckesson.com,42.217093,-75.284998,Angeles Crusoe,321540

In [6]:
# Test creation of db_name
text = 'pp.web_events.txt'
text.split('.')[1]

'web_events'

In [7]:
# Create function to read in file and save to engine
def add_to_engine(file_name):
    df = pd.read_csv(file_name, sep='\t')
    db_name = file_name.split('.')[1]
    df.to_sql(db_name, engine, index=False)

In [8]:
# Add all files to the engine
for file in glob.glob("*.txt"):
    # Manage existing names
    try:
        add_to_engine(file)
        print('Added {} to engine.'.format(file))
    except ValueError:
        continue

Added pp.accounts.txt to engine.
Added pp.orders.txt to engine.
Added pp.region.txt to engine.
Added pp.sales_reps.txt to engine.
Added pp.web_events.txt to engine.

In [12]:
# Print schema
metadata = MetaData()
metadata.reflect(engine)
for table in metadata.tables.values():
    print('\n' + table.name)
    for column in table.c:
        print('  ' + column.name)

accounts
  id
  name
  website
  lat
  long
  primary_poc
  sales_rep_id

orders
  id
  account_id
  occurred_at
  standard_qty
  gloss_qty
  poster_qty
  total
  standard_amt_usd
  gloss_amt_usd
  poster_amt_usd
  total_amt_usd

region
  id
  name

sales_reps
  id
  name
  region_id

web_events
  id
  account_id
  occurred_at
  channel

In [13]:
# Create function to speed up code
def sql_query(query_syntax):
    df = pd.read_sql(query_syntax, engine)
    return df

## Lesson 1: Basic SQL
### Basic Query
Try writing your own query to select only the `id`, `account_id`, and `occurred_at` columns for all **orders** in the orders table.

In [14]:
sql_query('SELECT id, account_id, occurred_at \
           FROM orders;')

        id  account_id               occurred_at
0        1        1001  2015-10-06T17:31:14.000Z
1        2        1001  2015-11-05T03:34:33.000Z
2        3        1001  2015-12-04T04:21:55.000Z
3        4        1001  2016-01-02T01:18:24.000Z
4        5        1001  2016-02-01T19:27:27.000Z
5        6        1001  2016-03-02T15:29:32.000Z
6        7        1001  2016-04-01T11:20:18.000Z
7        8        1001  2016-05-01T15:55:51.000Z
8        9        1001  2016-05-31T21:22:48.000Z
9       10        1001  2016-06-30T12:32:05.000Z
10      11        1001  2016-07-30T03:26:30.000Z
11      12        1001  2016-08-28T07:13:39.000Z
12      13        1001  2016-09-26T23:28:25.000Z
13      14        1001  2016-10-26T20:31:30.000Z
14      15        1001  2016-11-25T23:21:32.000Z
15      16        1001  2016-12-24T05:53:13.000Z
16      17        1011  2016-12-21T10:59:34.000Z
17      18        1021  2015-10-12T02:21:56.000Z
18      19        1021  2015-11-11T07:37:01.000Z
19      20        1021  2015-12-11T16:53:18.000Z
20      21        1021  2016-01-10T09:29:45.000Z
21      22        1021  2016-02-09T00:50:46.000Z
22      23        1021  2016-03-10T00:38:52.000Z
23      24        1031  2016-12-25T03:54:27.000Z
24      25        1041  2016-10-14T23:54:21.000Z
25      26        1041  2016-11-13T10:11:52.000Z
26      27        1041  2016-12-12T07:50:01.000Z
27      28        1051  2016-08-02T20:13:27.000Z
28      29        1051  2016-09-01T05:38:19.000Z
29      30        1051  2016-10-01T00:48:28.000Z
...    ...         ...                       ...
6882  6883        4461  2015-12-08T08:20:02.000Z
6883  6884        4461  2016-01-06T23:56:04.000Z
6884  6885        4461  2016-02-04T21:12:41.000Z
6885  6886        4461  2016-06-01T05:36:30.000Z
6886  6887        4461  2016-07-01T11:07:48.000Z
6887  6888        4461  2016-07-30T10:38:37.000Z
6888  6889        4461  2016-08-28T13:11:30.000Z
6889  6890        4461  2016-09-26T08:44:11.000Z
6890  6891        4461  2016-11-24T16:28:38.000Z
6891  6892        4461  2016-12-23T17:36:00.000Z
6892  6893        4471  2016-12-05T05:10:54.000Z
6893  6894        4481  2016-10-08T07:38:46.000Z
6894  6895        4481  2016-11-07T12:54:03.000Z
6895  6896        4491  2013-12-08T06:34:23.000Z
6896  6897        4491  2014-01-06T08:11:00.000Z
6897  6898        4491  2014-02-04T03:04:08.000Z
6898  6899        4491  2014-03-06T05:22:25.000Z
6899  6900        4491  2014-05-05T00:03:19.000Z
6900  6901        4491  2014-07-31T05:05:06.000Z
6901  6902        4491  2014-08-29T17:15:24.000Z
6902  6903        4491  2014-09-28T15:53:06.000Z
6903  6904        4491  2014-10-27T19:05:05.000Z
6904  6905        4491  2014-12-26T21:39:04.000Z
6905  6906        4491  2015-01-24T07:15:47.000Z
6906  6907        4491  2015-02-22T07:24:04.000Z
6907  6908        4501  2016-06-29T04:03:39.000Z
6908  6909        4501  2016-07-29T19:58:32.000Z
6909  6910        4501  2016-08-27T00:58:11.000Z
6910  6911        4501  2016-11-22T06:52:22.000Z
6911  6912        4501  2016-12-21T13:30:42.000Z

[6912 rows x 3 columns]

### Limit

In [16]:
sql_query('SELECT occurred_at, account_id, channel \
           FROM web_events \
           LIMIT 15;')

                 occurred_at  account_id channel
0   2015-10-06T17:13:58.000Z        1001  direct
1   2015-11-05T03:08:26.000Z        1001  direct
2   2015-12-04T03:57:24.000Z        1001  direct
3   2016-01-02T00:55:03.000Z        1001  direct
4   2016-02-01T19:02:33.000Z        1001  direct
5   2016-03-02T15:15:22.000Z        1001  direct
6   2016-04-01T10:58:55.000Z        1001  direct
7   2016-05-01T15:26:44.000Z        1001  direct
8   2016-05-31T20:53:47.000Z        1001  direct
9   2016-06-30T12:09:45.000Z        1001  direct
10  2016-07-30T03:06:26.000Z        1001  direct
11  2016-08-28T06:42:42.000Z        1001  direct
12  2016-09-26T23:14:59.000Z        1001  direct
13  2016-10-26T20:21:09.000Z        1001  direct
14  2016-11-25T22:52:29.000Z        1001  direct

### Order By
ORDER BY comes after SELECT and FROM but before LIMIT. DESC can be used to sort in descending order.

**1** Write a query to return the 10 earliest orders in the **orders** table. Include the `id`, `occurred_at`, and `total_amt_usd`.

In [17]:
sql_query('SELECT id, occurred_at, total_amt_usd \
           FROM orders \
           ORDER BY occurred_at \
           LIMIT 10;')

     id               occurred_at  total_amt_usd
0  5786  2013-12-04T04:22:44.000Z         627.48
1  2415  2013-12-04T04:45:54.000Z        2646.77
2  4108  2013-12-04T04:53:25.000Z        2709.62
3  4489  2013-12-05T20:29:16.000Z         277.13
4   287  2013-12-05T20:33:56.000Z        3001.85
5  1946  2013-12-06T02:13:20.000Z        2802.90
6  6197  2013-12-06T12:55:22.000Z        7009.18
7  3122  2013-12-06T12:57:41.000Z        1992.13
8  6078  2013-12-06T13:14:47.000Z        6680.06
9  2932  2013-12-06T13:17:25.000Z        2075.94

**2** Write a query to return the top 5 **orders** in terms of largest `total_amt_usd`. Include the `id`, `account_id`, and `total_amt_usd`.

In [47]:
sql_query('SELECT id, account_id, total_amt_usd \
           FROM orders \
           ORDER BY total_amt_usd DESC \
           LIMIT 5;')

     id  account_id  total_amt_usd
0  4016        4251      232207.07
1  3892        4161      112875.18
2  3963        4211      107533.55
3  5791        2861       95005.82
4  3778        4101       93547.84

**3** Write a query to return the bottom 20 **orders** in terms of least `total`. Include the `id`, `account_id`, and `total`.

In [48]:
sql_query('SELECT id, account_id, total \
           FROM orders \
           ORDER BY total \
           LIMIT 20;')

      id  account_id  total
0    124        1131      0
1   1353        1951      0
2   2518        2881      0
3   4445        1221      0
4   4446        1231      0
5   4490        1281      0
6   4625        1411      0
7   4770        1521      0
8   4844        1571      0
9   5001        1791      0
10  5057        1851      0
11  5612        2601      0
12  6009        3141      0
13  6281        3491      0
14  6312        3541      0
15  6323        3551      0
16  6375        3651      0
17  6435        3801      0
18  6523        3991      0
19  6856        4451      0

ORDER BY can be used on multiple columns, separated by a comma, sorted by the left-most column first and continuing through the list. DESC can continue to be used as needed.

**4** Write a query that displays the order ID, account ID, and total dollar amount for all the orders, sorted first by the account ID (in ascending order), and then by the total dollar amount (in descending order).

In [18]:
sql_query('SELECT id, account_id, total \
           FROM orders \
           ORDER BY account_id, total DESC;')

        id  account_id  total
0     4308        1001   1410
1     4309        1001   1405
2     4316        1001   1384
3     4317        1001   1347
4     4314        1001   1343
5     4307        1001   1321
6     4311        1001   1307
7     4310        1001   1280
8     4312        1001   1267
9     4313        1001   1254
10    4315        1001   1238
11    4318        1001   1205
12      14        1001    294
13       8        1001    293
14       2        1001    288
15      16        1001    269
16       7        1001    226
17      15        1001    210
18      12        1001    196
19       4        1001    176
20       6        1001    173
21       1        1001    169
22       5        1001    165
23      13        1001    158
24      10        1001    148
25      11        1001    137
26       3        1001    132
27       9        1001    129
28      17        1011    541
29      23        1021    578
...    ...         ...    ...
6882  4286        4491    483
6883  4283        4491    445
6884  4291        4491    428
6885  4293        4491    419
6886  4282        4491    377
6887  4285        4491    366
6888  4290        4491    352
6889  4296        4491    351
6890  4297        4491    341
6891  4288        4491    336
6892  4295        4491    335
6893  4284        4491    330
6894  4298        4491    324
6895  4287        4491    319
6896  4294        4491    315
6897  4289        4491    314
6898  4292        4491    308
6899  6908        4501    269
6900  6912        4501    263
6901  4303        4501    224
6902  4302        4501    215
6903  6911        4501    211
6904  4304        4501    200
6905  6909        4501    192
6906  6910        4501    192
6907  4301        4501    164
6908  4300        4501    149
6909  4306        4501    126
6910  4299        4501     26
6911  4305        4501     13

[6912 rows x 3 columns]

**5** Now write a query that again displays order ID, account ID, and total dollar amount for each order, but this time sorted first by total dollar amount (in descending order), and then by account ID (in ascending order).

In [19]:
sql_query('SELECT id, account_id, total \
           FROM orders \
           ORDER BY total DESC, account_id;')

        id  account_id  total
0     4016        4251  28799
1     3892        4161  22610
2     4562        1341  16428
3     3963        4211  14395
4      731        1521  12598
5     3778        4101  11704
6     5791        2861  11701
7     6590        4111  11573
8      362        1301  11509
9     4942        1701  10839
10    3858        4151  10186
11    1191        1831   9638
12    5479        2441   8485
13    5167        2041   7818
14    1913        2461   6495
15    1112        1781   6059
16    5478        2441   5412
17    4698        1451   5385
18     320        1281   5078
19    4230        4451   4989
20    3472        3721   4484
21    5641        2631   4476
22    4806        1541   4304
23    1939        2461   4259
24    1245        1871   4166
25    6442        3811   3981
26    5983        3101   3693
27    5227        2101   3666
28    6579        4111   3525
29    4369        1111   3474
...    ...         ...    ...
6882  3167        3451     10
6883  1284        1881      9
6884  5708        2691      9
6885  2355        2761      7
6886  5151        2001      6
6887  1994        2501      5
6888  4219        4441      4
6889   730        1521      2
6890   860        1571      2
6891  5646        2641      2
6892   124        1131      0
6893  4445        1221      0
6894  4446        1231      0
6895  4490        1281      0
6896  4625        1411      0
6897  4770        1521      0
6898  4844        1571      0
6899  5001        1791      0
6900  5057        1851      0
6901  1353        1951      0
6902  5612        2601      0
6903  2518        2881      0
6904  6009        3141      0
6905  6281        3491      0
6906  6312        3541      0
6907  6323        3551      0
6908  6375        3651      0
6909  6435        3801      0
6910  6523        3991      0
6911  6856        4451      0

[6912 rows x 3 columns]

**How do these results differ?**

In the first query each account is listed and then the totals are listed in descending order. However in the second query, we get all of the totals in descending order, and account id will only be sorted if there are two ids with the same order amount. In the first 30 results we don't find such an occurrence.

### Where
Where provides conditional filtering options. Common symbols in WHERE statements include:
- `>` greater than
- `<` less than
- `>=` greater than or equal to
- `<=` less than or equal to
- `=` equal to 
- `!=` not equal to

WHERE is included after SELECT and FROM and before ORDER BY.

Write a query that:
1. Pulls the first 5 rows and all columns from the orders table that have a dollar amount of `gloss_amt_usd` greater than or equal to 1000.
2. Pulls the first 10 rows and all columns from the orders table that have a `total_amt_usd` less than 500.

In [17]:
# 1 Pull the first 5 rows and all columns from the orders table that 
#   have a dollar amount of gloss_amt_usd greater than or equal to 1000.
sql_query('SELECT * \
           FROM orders \
           WHERE gloss_amt_usd >= 1000 \
           LIMIT 5;')

,id,account_id,occurred_at,standard_qty,gloss_qty,poster_qty,total,standard_amt_usd,gloss_amt_usd,poster_amt_usd,total_amt_usd
0,14,1001,2016-10-26T20:31:30.000Z,97,143,54,294,484.03,1071.07,438.48,1993.58
1,62,1091,2014-10-13T12:12:55.000Z,146,196,3,345,728.54,1468.04,24.36,2220.94
2,88,1101,2015-06-24T13:08:15.000Z,182,339,17,538,908.18,2539.11,138.04,3585.33
3,121,1131,2016-08-10T23:47:41.000Z,273,134,0,407,1362.27,1003.66,0.00,2365.93
4,129,1141,2016-12-21T15:52:58.000Z,143,1045,2157,3345,713.57,7827.05,17514.84,26055.46

In [18]:
# 2 Pull the first 10 rows and all columns from the orders table that 
#   have a total_amt_usd less than 500.
sql_query('SELECT * \
           FROM orders \
           WHERE total_amt_usd < 500 \
           LIMIT 10;')

,id,account_id,occurred_at,standard_qty,gloss_qty,poster_qty,total,standard_amt_usd,gloss_amt_usd,poster_amt_usd,total_amt_usd
0,67,1091,2015-04-07T13:29:20.000Z,95,0,0,95,474.05,0.00,0.00,474.05
1,96,1101,2016-03-15T11:36:03.000Z,14,8,16,38,69.86,59.92,129.92,259.70
2,119,1131,2016-06-12T12:29:45.000Z,0,30,23,53,0.00,224.70,186.76,411.46
3,124,1131,2016-11-07T05:10:56.000Z,0,0,0,0,0.00,0.00,0.00,0.00
4,254,1251,2014-11-01T02:15:24.000Z,0,0,17,17,0.00,0.00,138.04,138.04
5,328,1291,2015-08-03T08:35:23.000Z,0,19,21,40,0.00,142.31,170.52,312.83
6,542,1421,2015-11-13T09:07:09.000Z,0,64,0,64,0.00,479.36,0.00,479.36
7,683,1501,2016-04-14T23:59:50.000Z,0,15,16,31,0.00,112.35,129.92,242.27
8,713,1521,2014-11-23T16:04:03.000Z,0,8,10,18,0.00,59.92,81.20,141.12
9,730,1521,2016-05-06T02:34:48.000Z,0,0,2,2,0.00,0.00,16.24,16.24

#### WHERE with Non-Numeric
3. Filter the accounts table to include the company `name`, `website`, and the primary point of contact (`primary_poc`) just for the Exxon Mobil company in the **accounts** table.

In [19]:
sql_query('SELECT name, website, primary_poc \
           FROM accounts \
           WHERE name = \'Exxon Mobil\';')

          name             website   primary_poc
0  Exxon Mobil  www.exxonmobil.com  Sung Shields

### Derived Columns
A derived column is one that is created from a combination of existing columns. Usually a name or alias is given to the new column using the AS keyword. Derived columns typically exist only for the duration of the query.

If creating the column via mathematical expression, standard mathematial operators can be used.

In [20]:
# Example
sql_query('SELECT id, (standard_amt_usd/total_amt_usd)*100 AS std_percent, total_amt_usd \
           FROM orders \
           LIMIT 10;')

   id  std_percent  total_amt_usd
0   1    63.052300         973.43
1   2    55.185299        1718.03
2   3    54.645830         776.18
3   4    74.987477         958.24
4   5    54.796693         983.49
5   6    48.158351        1067.25
6   7    33.639701        1498.20
7   8    23.099600        2052.20
8   9    60.338573         752.57
9  10    53.389638         878.56

Here we've created a column for "standard percentage" as part of the query.

Using the **orders** table:

1. Create a column that divides the `standard_amt_usd` by the `standard_qty` to find the unit price for standard paper for each order. Limit the results to the first 10 orders, and include the `id` and `account_id` fields. 

2. Write a query that finds the percentage of revenue that comes from poster paper for each order. You will need to use only the columns that end with `_usd`. (Try to do this without using the total column.) Display the `id` and `account_id` fields also. Limit your calculations to the first 10 orders.

In [23]:
# 1 Find the unit price for standard paper for each order. 
#   Limit to first 10 orders, and include the id and account_id fields.
sql_query('SELECT id, account_id, standard_amt_usd/standard_qty AS std_unit_price \
           FROM orders \
           LIMIT 10;')

   id  account_id  std_unit_price
0   1        1001            4.99
1   2        1001            4.99
2   3        1001            4.99
3   4        1001            4.99
4   5        1001            4.99
5   6        1001            4.99
6   7        1001            4.99
7   8        1001            4.99
8   9        1001            4.99
9  10        1001            4.99

In [22]:
# 2 Find the percentage of revenue that comes from poster paper for each order.
#   Display the id and account_id fields also. Limit to the first 10 orders.
sql_query('SELECT id, account_id, poster_amt_usd/(standard_amt_usd + gloss_amt_usd + poster_amt_usd)*100 AS pos_percent \
           FROM orders \
           LIMIT 10;')

   id  account_id  pos_percent
0   1        1001    20.019930
1   2        1001    26.940158
2   3        1001     0.000000
3   4        1001     0.000000
4   5        1001    23.117673
5   6        1001    34.998360
6   7        1001    49.862502
7   8        1001    59.746613
8   9        1001    23.737327
9  10        1001     7.393917

### Logical Operators
1. **LIKE**: This allows you to perform operations similar to using WHERE and `=`, but for cases when you might not know exactly what you are looking for. LIKE is frequently used with `%`. This acts as a wild card in a search term. These phrases are case sensitive.
2. **IN**: This allows you to perform operations similar to using WHERE and `=`, but for more than one condition. For example, `IN ('Walmart', 'Apple')`.
3. **NOT**: This is used with IN and LIKE to select all of the rows NOT LIKE or NOT IN a certain condition.
4. **AND** & **BETWEEN**: These allow you to combine operations where all combined conditions must be true.
5. **OR**: This allow you to combine operations where at least one of the combined conditions must be true.

#### LIKE
Use the **accounts** table to find:
1. All the companies whose names start with 'C'. 
2. All companies whose names contain the string 'one' somewhere in the name.
3. All companies whose names end with 's'.

In [27]:
# 1 All the companies whose names start with 'C'.
sql_query('SELECT name \
           FROM accounts \
           WHERE name LIKE "C%";')

                              name
0                       CVS Health
1                          Chevron
2                           Costco
3                  Cardinal Health
4                        Citigroup
5                          Comcast
6                    Cisco Systems
7                      Caterpillar
8                        Coca-Cola
9                            Cigna
10                             CHS
11                  ConocoPhillips
12           Capital One Financial
13                         Centene
14        Community Health Systems
15                         Cummins
16                     CenturyLink
17               Colgate-Palmolive
18                   ConAgra Foods
19                          CarMax
20                             CBS
21         C.H. Robinson Worldwide
22                             CDW
23               Chesapeake Energy
24             Consolidated Edison
25  Cognizant Technology Solutions
26               Computer Sciences
27                             CSX
28                      CBRE Group
29          Charter Communications
30                      CST Brands
31                         Celgene
32                         Corning
33               Core-Mark Holding
34           Cameron International
35                  Crown Holdings
36                   Campbell Soup

In [28]:
# 2 All companies whose names contain the string 'one' somewhere in the name.
sql_query('SELECT name \
           FROM accounts \
           WHERE name LIKE "%one%";')

                      name
0  Honeywell International
1             INTL FCStone
2    Capital One Financial
3                 AutoZone
4                    Oneok

Hmm, looks like in this version the search is not case sensitive.

In [29]:
# 3 All companies whose names end with 's'.
sql_query('SELECT name \
           FROM accounts \
           WHERE name LIKE "%s";')

                                name
0                     General Motors
1                United Technologies
2                             Lowe's
3                                UPS
4                      Cisco Systems
5                       HCA Holdings
6                        Tyson Foods
7                    Delta Air Lines
8                   Johnson Controls
9                        Ross Stores
10       United Continental Holdings
11                               CHS
12                  American Express
13                   Gilead Sciences
14              Publix Super Markets
15                  General Dynamics
16                    ConocoPhillips
17               World Fuel Services
18                            Macy's
19      Enterprise Products Partners
20                        McDonald's
21                    Sears Holdings
22                 Arrow Electronics
23                Plains GP Holdings
24          Community Health Systems
25                           Staples
26               Abbott Laboratories
27                Southwest Airlines
28                            Kohl's
29                         Starbucks
..                               ...
51                   Las Vegas Sands
52                Dominion Resources
53                L-3 Communications
54                  Sherwin-Williams
55         Hilton Worldwide Holdings
56             R.R. Donnelley & Sons
57             Hertz Global Holdings
58                   Global Partners
59               Precision Castparts
60       Discover Financial Services
61          Air Products & Chemicals
62         Universal Health Services
63            Charter Communications
64                Advance Auto Parts
65                 Applied Materials
66                        CST Brands
67                      Hormel Foods
68                   PayPal Holdings
69                 Republic Services
70  Thrivent Financial for Lutherans
71                HD Supply Holdings
72                    Crown Holdings
73                     EOG Resources
74                    SunTrust Banks
75            Level 3 Communications
76              United Natural Foods
77                        Dean Foods
78                 Mohawk Industries
79                Franklin Resources
80                     Lithia Motors

[81 rows x 1 columns]

#### IN
1. Use the **accounts** table to find the account `name`, `primary_poc`, and `sales_rep_id` for Walmart, Target, and Nordstrom.
2. Use the **web_events** table to find all information regarding individuals who were contacted via the **channel** of `organic` or `adwords`.

In [33]:
# 1 Find the account name, primary_poc, and sales_rep_id for 
#   Walmart, Target, and Nordstrom
sql_query('SELECT name, primary_poc, sales_rep_id \
           FROM accounts \
           WHERE name in ("Walmart", "Target", "Nordstrom");')

        name   primary_poc  sales_rep_id
0    Walmart   Tamara Tuma        321500
1     Target  Luba Streett        321660
2  Nordstrom    Yan Crater        321820

In [20]:
# 2 Find all information regarding individuals who were contacted via 
#   the channel of organic or adwords
sql_query('SELECT * \
           FROM web_events \
           WHERE channel IN ("organic", "adwords");')

        id  account_id               occurred_at  channel
0     4395        1001  2015-10-22T05:02:47.000Z  organic
1     4396        1001  2015-10-22T14:04:20.000Z  adwords
2     4399        1001  2016-01-01T15:45:54.000Z  adwords
3     4401        1001  2016-02-07T17:44:10.000Z  adwords
4     4402        1001  2016-02-27T15:27:22.000Z  organic
5     4404        1001  2016-04-05T03:02:52.000Z  organic
6     4405        1001  2016-04-17T16:41:02.000Z  organic
7     4408        1001  2016-05-21T16:22:01.000Z  organic
8     4410        1001  2016-06-22T13:48:53.000Z  adwords
9     4414        1001  2016-08-12T09:31:22.000Z  organic
10    4416        1001  2016-09-11T17:06:53.000Z  adwords
11    4417        1011  2016-12-21T16:14:29.000Z  adwords
12    4420        1021  2015-10-26T03:14:39.000Z  adwords
13    4425        1021  2016-02-02T22:06:55.000Z  adwords
14    4427        1021  2016-03-02T00:38:48.000Z  adwords
15    4428        1021  2016-03-02T09:37:48.000Z  adwords
16    4431        1021  2016-04-23T04:41:13.000Z  organic
17    4432        1021  2016-05-04T03:29:12.000Z  organic
18    4433        1021  2016-05-26T13:31:54.000Z  organic
19    4434        1021  2016-06-03T21:40:58.000Z  organic
20    4442        1021  2016-10-18T18:43:20.000Z  adwords
21    4443        1021  2016-11-18T05:27:58.000Z  adwords
22    4444        1021  2016-12-11T00:36:56.000Z  adwords
23    4445        1021  2016-12-25T10:35:26.000Z  organic
24    4446        1021  2017-01-01T02:56:41.000Z  organic
25    4449        1041  2016-10-27T18:31:05.000Z  adwords
26    4450        1041  2016-11-12T05:36:00.000Z  adwords
27    4451        1041  2016-11-30T05:26:50.000Z  adwords
28    4455        1051  2016-09-27T04:50:39.000Z  organic
29    4456        1051  2016-11-28T10:22:58.000Z  adwords
...    ...         ...                       ...      ...
1828  9006        4451  2016-03-26T12:50:58.000Z  adwords
1829  9008        4451  2016-06-02T03:31:01.000Z  organic
1830  9010        4451  2016-07-27T16:27:00.000Z  organic
1831  9011        4451  2016-08-29T15:42:12.000Z  adwords
1832  9012        4451  2016-09-23T21:20:38.000Z  adwords
1833  9013        4451  2016-11-02T02:46:04.000Z  adwords
1834  9020        4461  2015-01-07T22:53:31.000Z  organic
1835  9022        4461  2015-05-14T19:02:21.000Z  adwords
1836  9025        4461  2015-08-28T09:53:29.000Z  adwords
1837  9026        4461  2015-09-08T16:31:47.000Z  adwords
1838  9032        4481  2016-10-08T06:55:47.000Z  organic
1839  9033        4481  2016-11-20T15:33:13.000Z  adwords
1840  9034        4491  2013-12-08T15:59:41.000Z  adwords
1841  9036        4491  2013-12-18T12:48:40.000Z  adwords
1842  9039        4491  2014-03-20T23:04:20.000Z  organic
1843  9045        4491  2014-12-07T08:37:43.000Z  adwords
1844  9046        4491  2014-12-15T23:57:06.000Z  adwords
1845  9047        4491  2015-02-04T23:52:08.000Z  adwords
1846  9048        4491  2015-03-05T23:54:20.000Z  organic
1847  9050        4491  2015-04-29T19:34:03.000Z  adwords
1848  9051        4491  2015-05-24T13:51:39.000Z  organic
1849  9055        4491  2015-10-02T15:24:42.000Z  adwords
1850  9056        4491  2015-11-09T17:53:11.000Z  adwords
1851  9057        4491  2015-12-17T02:59:16.000Z  adwords
1852  9058        4491  2016-01-11T02:26:45.000Z  adwords
1853  9064        4491  2016-05-06T05:03:27.000Z  adwords
1854  9065        4491  2016-06-17T19:43:12.000Z  adwords
1855  9071        4491  2016-11-06T07:23:45.000Z  organic
1856  9072        4491  2016-12-18T03:21:31.000Z  organic
1857  9073        4501  2016-05-30T00:46:53.000Z  organic

[1858 rows x 4 columns]

#### NOT
We can pull all of the rows that were excluded from the queries in the previous two concepts with our new operator.
1. Use the **accounts** table to find the account name, primary poc, and sales rep id for all stores _except_ Walmart, Target, and Nordstrom.
2. Use the **web_events** table to find all information regarding individuals who were contacted via any method except using `organic` or `adwords` methods.

In [21]:
# 1 Find the account name, primary poc, and sales rep id for all stores except
#   Walmart, Target, and Nordstrom.
sql_query('SELECT name, primary_poc, sales_rep_id \
           FROM accounts \
           WHERE name NOT IN ("Walmart", "Target", "Nordstrom");')

                                name          primary_poc  sales_rep_id
0                        Exxon Mobil         Sung Shields        321510
1                              Apple           Jodee Lupo        321520
2                 Berkshire Hathaway       Serafina Banda        321530
3                           McKesson       Angeles Crusoe        321540
4                 UnitedHealth Group       Savanna Gayman        321550
5                         CVS Health       Anabel Haskell        321560
6                     General Motors        Barrie Omeara        321570
7                         Ford Motor         Kym Hagerman        321580
8                               AT&T       Jamel Mosqueda        321590
9                   General Electric        Parker Hoggan        321600
10                 AmerisourceBergen         Tuan Trainer        321610
11                           Verizon    Chantell Drescher        321620
12                           Chevron         Paige Bartos        321630
13                            Costco     Dominique Favela        321640
14                        Fannie Mae      Terrilyn Kesler        321650
15                            Kroger      Nannie Brinkman        321660
16                        Amazon.com          Buffy Azure        321670
17          Walgreens Boots Alliance      Esta Engelhardt        321680
18                                HP     Khadijah Riemann        321690
19                   Cardinal Health      Deanne Hertlein        321700
20           Express Scripts Holding         Jewell Likes        321500
21                 J.P. Morgan Chase  Florentino Madrigal        321510
22                            Boeing          Melva Lyall        321520
23                         Microsoft      Dennise Hungate        321530
24             Bank of America Corp.          Janise Voth        321540
25                       Wells Fargo       Lakenya Volker        321550
26                        Home Depot    Alexandria Zielke        321560
27                         Citigroup             Bea Sera        321570
28                       Phillips 66        Maria Garibay        321580
29                               IBM           Denis Gros        321590
..                               ...                  ...           ...
318                    EOG Resources      Alida Desrosier        321940
319                          Veritiv        Karren Dively        321950
320               Anadarko Petroleum          Lacey Kight        321970
321      Laboratory Corp. of America        Domenic Mally        321980
322                     Pacific Life        Kyoko Randall        321990
323                       News Corp.       Sharie Sanborn        321960
324                           Jarden       Chantal Dahmen        321970
325                   SunTrust Banks   Monserrate Winsett        321930
326                Avis Budget Group          Tamara Tuma        321940
327                         Broadcom         Sung Shields        321950
328  American Family Insurance Group           Jodee Lupo        321930
329           Level 3 Communications       Serafina Banda        321940
330                          Tenneco       Angeles Crusoe        321910
331             United Natural Foods       Savanna Gayman        321920
332                       Dean Foods       Anabel Haskell        321910
333                    Campbell Soup         Barrie Omega        321920
334                Mohawk Industries         Kym Hagerman        321910
335                       BorgWarner       Jamel Mosqueda        321970
336                              PVH        Parker Hoggan        321980
337                             Ball         Tuan Trainer        321990
338              O'Reilly Automotive    Chantell Drescher        321970
339                Eversource Energy         Paige Bartos        321980
340               Franklin Resources     Dominique Favela        321970
341                            Masco      Terrilyn Kesler        321980
342                    Lithia Motors      Nannie Brinkman        321960
343                              KKR          Buffy Azure        321970
344                            Oneok      Esta Engelhardt        321960
345                   Newmont Mining     Khadijah Riemann        321970
346                              PPL      Deanne Hertlein        321960
347                      SpartanNash         Jewell Likes        321970

[348 rows x 3 columns]

In [22]:
# 2 Find all information regarding individuals who were contacted via any 
#   method except using organic or adwords methods.
sql_query('SELECT * \
           FROM web_events \
           WHERE channel NOT IN ("organic", "adwords");')

        id  account_id               occurred_at   channel
0        1        1001  2015-10-06T17:13:58.000Z    direct
1        2        1001  2015-11-05T03:08:26.000Z    direct
2        3        1001  2015-12-04T03:57:24.000Z    direct
3        4        1001  2016-01-02T00:55:03.000Z    direct
4        5        1001  2016-02-01T19:02:33.000Z    direct
5        6        1001  2016-03-02T15:15:22.000Z    direct
6        7        1001  2016-04-01T10:58:55.000Z    direct
7        8        1001  2016-05-01T15:26:44.000Z    direct
8        9        1001  2016-05-31T20:53:47.000Z    direct
9       10        1001  2016-06-30T12:09:45.000Z    direct
10      11        1001  2016-07-30T03:06:26.000Z    direct
11      12        1001  2016-08-28T06:42:42.000Z    direct
12      13        1001  2016-09-26T23:14:59.000Z    direct
13      14        1001  2016-10-26T20:21:09.000Z    direct
14      15        1001  2016-11-25T22:52:29.000Z    direct
15      16        1001  2016-12-24T05:35:14.000Z    direct
16      17        1011  2016-12-21T10:29:36.000Z    direct
17      18        1021  2015-10-12T02:10:54.000Z    direct
18      19        1021  2015-11-11T07:10:19.000Z    direct
19      20        1021  2015-12-11T16:28:27.000Z    direct
20      21        1021  2016-01-10T09:04:12.000Z    direct
21      22        1021  2016-02-09T00:46:47.000Z    direct
22      23        1021  2016-03-10T00:11:03.000Z    direct
23      24        1031  2016-12-25T03:51:33.000Z    direct
24      25        1041  2016-10-14T23:40:23.000Z    direct
25      26        1041  2016-11-13T09:43:28.000Z    direct
26      27        1041  2016-12-12T07:31:09.000Z    direct
27      28        1051  2016-08-02T19:48:31.000Z    direct
28      29        1051  2016-09-01T05:27:20.000Z    direct
29      30        1051  2016-10-01T00:17:52.000Z    direct
...    ...         ...                       ...       ...
7185  9021        4461  2015-02-04T05:47:55.000Z    direct
7186  9023        4461  2015-06-15T18:23:26.000Z    direct
7187  9024        4461  2015-07-24T01:34:13.000Z   twitter
7188  9027        4461  2015-10-08T17:55:11.000Z   twitter
7189  9028        4461  2015-11-15T14:21:10.000Z    banner
7190  9029        4461  2015-12-19T22:13:20.000Z   twitter
7191  9030        4471  2016-12-05T14:50:32.000Z  facebook
7192  9031        4471  2016-12-17T22:41:07.000Z    direct
7193  9035        4491  2013-12-18T09:56:50.000Z    direct
7194  9037        4491  2014-01-16T02:04:18.000Z  facebook
7195  9038        4491  2014-02-13T07:39:11.000Z    direct
7196  9040        4491  2014-04-21T20:26:51.000Z    direct
7197  9041        4491  2014-06-16T11:40:51.000Z    direct
7198  9042        4491  2014-07-21T10:28:33.000Z  facebook
7199  9043        4491  2014-08-25T15:49:17.000Z    direct
7200  9044        4491  2014-09-24T20:59:07.000Z   twitter
7201  9049        4491  2015-04-02T23:35:02.000Z    direct
7202  9052        4491  2015-06-26T02:40:31.000Z    direct
7203  9053        4491  2015-08-05T07:51:09.000Z    banner
7204  9054        4491  2015-09-02T22:05:41.000Z  facebook
7205  9059        4491  2016-01-11T10:37:21.000Z    banner
7206  9060        4491  2016-02-04T16:07:19.000Z    direct
7207  9061        4491  2016-03-10T19:42:34.000Z  facebook
7208  9062        4491  2016-04-04T05:37:02.000Z   twitter
7209  9063        4491  2016-04-04T15:57:45.000Z  facebook
7210  9066        4491  2016-07-18T21:31:10.000Z  facebook
7211  9067        4491  2016-08-14T15:41:44.000Z  facebook
7212  9068        4491  2016-09-11T19:18:07.000Z    banner
7213  9069        4491  2016-10-04T15:43:29.000Z  facebook
7214  9070        4491  2016-10-04T23:42:41.000Z   twitter

[7215 rows x 4 columns]

Use the **accounts** table to find:
3. All the companies whose names do not start with 'C'.
4. All companies whose names do not contain the string 'one' somewhere in the name.
5. All companies whose names do not end with 's'.

In [23]:
# 1 All the companies whose names do not start with 'C'.
sql_query('SELECT name \
           FROM accounts \
           WHERE name NOT LIKE "C%";')

                                name
0                            Walmart
1                        Exxon Mobil
2                              Apple
3                 Berkshire Hathaway
4                           McKesson
5                 UnitedHealth Group
6                     General Motors
7                         Ford Motor
8                               AT&T
9                   General Electric
10                 AmerisourceBergen
11                           Verizon
12                        Fannie Mae
13                            Kroger
14                        Amazon.com
15          Walgreens Boots Alliance
16                                HP
17           Express Scripts Holding
18                 J.P. Morgan Chase
19                            Boeing
20                         Microsoft
21             Bank of America Corp.
22                       Wells Fargo
23                        Home Depot
24                       Phillips 66
25                               IBM
26                     Valero Energy
27                            Anthem
28                  Procter & Gamble
29         State Farm Insurance Cos.
..                               ...
284               HD Supply Holdings
285                    EOG Resources
286                          Veritiv
287               Anadarko Petroleum
288      Laboratory Corp. of America
289                     Pacific Life
290                       News Corp.
291                           Jarden
292                   SunTrust Banks
293                Avis Budget Group
294                         Broadcom
295  American Family Insurance Group
296           Level 3 Communications
297                          Tenneco
298             United Natural Foods
299                       Dean Foods
300                Mohawk Industries
301                       BorgWarner
302                              PVH
303                             Ball
304              O'Reilly Automotive
305                Eversource Energy
306               Franklin Resources
307                            Masco
308                    Lithia Motors
309                              KKR
310                            Oneok
311                   Newmont Mining
312                              PPL
313                      SpartanNash

[314 rows x 1 columns]

In [24]:
# 2
sql_query('SELECT name \
           FROM accounts \
           WHERE name NOT LIKE "%one%";')

                                name
0                            Walmart
1                        Exxon Mobil
2                              Apple
3                 Berkshire Hathaway
4                           McKesson
5                 UnitedHealth Group
6                         CVS Health
7                     General Motors
8                         Ford Motor
9                               AT&T
10                  General Electric
11                 AmerisourceBergen
12                           Verizon
13                           Chevron
14                            Costco
15                        Fannie Mae
16                            Kroger
17                        Amazon.com
18          Walgreens Boots Alliance
19                                HP
20                   Cardinal Health
21           Express Scripts Holding
22                 J.P. Morgan Chase
23                            Boeing
24                         Microsoft
25             Bank of America Corp.
26                       Wells Fargo
27                        Home Depot
28                         Citigroup
29                       Phillips 66
..                               ...
316                   Crown Holdings
317                    EOG Resources
318                          Veritiv
319               Anadarko Petroleum
320      Laboratory Corp. of America
321                     Pacific Life
322                       News Corp.
323                           Jarden
324                   SunTrust Banks
325                Avis Budget Group
326                         Broadcom
327  American Family Insurance Group
328           Level 3 Communications
329                          Tenneco
330             United Natural Foods
331                       Dean Foods
332                    Campbell Soup
333                Mohawk Industries
334                       BorgWarner
335                              PVH
336                             Ball
337              O'Reilly Automotive
338                Eversource Energy
339               Franklin Resources
340                            Masco
341                    Lithia Motors
342                              KKR
343                   Newmont Mining
344                              PPL
345                      SpartanNash

[346 rows x 1 columns]

In [25]:
# 3 All companies whose names do not contain the string 'one' somewhere in 
#   the name.
sql_query('SELECT name \
           FROM accounts \
           WHERE name NOT LIKE "%s";')

                                name
0                            Walmart
1                        Exxon Mobil
2                              Apple
3                 Berkshire Hathaway
4                           McKesson
5                 UnitedHealth Group
6                         CVS Health
7                         Ford Motor
8                               AT&T
9                   General Electric
10                 AmerisourceBergen
11                           Verizon
12                           Chevron
13                            Costco
14                        Fannie Mae
15                            Kroger
16                        Amazon.com
17          Walgreens Boots Alliance
18                                HP
19                   Cardinal Health
20           Express Scripts Holding
21                 J.P. Morgan Chase
22                            Boeing
23                         Microsoft
24             Bank of America Corp.
25                       Wells Fargo
26                        Home Depot
27                         Citigroup
28                       Phillips 66
29                               IBM
..                               ...
240                          Autoliv
241      Fidelity National Financial
242                          Corning
243               Peter Kiewit Sons'
244                           Univar
245                           Mosaic
246                Core-Mark Holding
247            Cameron International
248                          Veritiv
249               Anadarko Petroleum
250      Laboratory Corp. of America
251                     Pacific Life
252                       News Corp.
253                           Jarden
254                Avis Budget Group
255                         Broadcom
256  American Family Insurance Group
257                          Tenneco
258                    Campbell Soup
259                       BorgWarner
260                              PVH
261                             Ball
262              O'Reilly Automotive
263                Eversource Energy
264                            Masco
265                              KKR
266                            Oneok
267                   Newmont Mining
268                              PPL
269                      SpartanNash

[270 rows x 1 columns]

#### AND and BETWEEN
1. Write a query that returns all the **orders** where the `standard_qty` is over 1000, the `poster_qty` is 0, and the `gloss_qty` is 0.
2. Using the **accounts table**, find all the companies whose names do not start with 'C' and end with 's'.
3. When you use the BETWEEN operator in SQL, do the results include the values of your endpoints, or not? Figure out the answer to this important question by writing a query that displays the order date and `gloss_qty` data for all orders where gloss_qty is between 24 and 29. Then look at your output to see if the BETWEEN operator included the begin and end values or not.
4. Use the **web_events** table to find all information regarding individuals who were contacted via the `organic` or `adwords` channels, and started their account at any point in 2016, sorted from newest to oldest.

In [27]:
# 1 Return all the orders where the standard_qty is over 1000, the poster_qty 
#   is 0, and the gloss_qty is 0
sql_query('SELECT * \
           FROM orders \
           WHERE standard_qty > 1000 AND poster_qty = 0 AND gloss_qty = 0;')

,id,account_id,occurred_at,standard_qty,gloss_qty,poster_qty,total,standard_amt_usd,gloss_amt_usd,poster_amt_usd,total_amt_usd
0,2613,2951,2016-08-15T00:06:12.000Z,1171,0,0,1171,5843.29,0.0,0.0,5843.29
1,3260,3491,2014-08-29T22:43:00.000Z,1552,0,0,1552,7744.48,0.0,0.0,7744.48

In [29]:
# 2 Find all the companies whose names do not start with 'C' and end with 's'
sql_query('SELECT name \
           FROM accounts \
           WHERE name NOT LIKE "C%" AND name NOT LIKE "%s%";')

                            name
0                        Walmart
1                    Exxon Mobil
2                          Apple
3             UnitedHealth Group
4                     Ford Motor
5                           AT&T
6               General Electric
7                        Verizon
8                     Fannie Mae
9                         Kroger
10                    Amazon.com
11                            HP
12                        Boeing
13         Bank of America Corp.
14                    Home Depot
15                           IBM
16                 Valero Energy
17                        Anthem
18              Procter & Gamble
19                      Alphabet
20                        Target
21                       MetLife
22            Marathon Petroleum
23                   Freddie Mac
24                         Aetna
25                           AIG
26          Prudential Financial
27                         Intel
28                        Humana
29                        Pfizer
..                           ...
124           Group 1 Automotive
125                   BB&T Corp.
126                   DTE Energy
127                     AutoZone
128          Liberty Interactive
129                W.W. Grainger
130         Baxter International
131               Ally Financial
132                         eBay
133                       Lennar
134           Genworth Financial
135              Priceline Group
136                      Autoliv
137  Fidelity National Financial
138                       Univar
139                      Veritiv
140           Anadarko Petroleum
141  Laboratory Corp. of America
142                 Pacific Life
143                       Jarden
144                     Broadcom
145                      Tenneco
146                   BorgWarner
147                          PVH
148                         Ball
149          O'Reilly Automotive
150                          KKR
151                        Oneok
152               Newmont Mining
153                          PPL

[154 rows x 1 columns]

In [30]:
# 3 When you use the BETWEEN operator in SQL, do the results include the 
#   values of your endpoints, or not?
sql_query('SELECT occurred_at, gloss_qty \
           FROM orders \
           WHERE gloss_qty BETWEEN 24 AND 29;')

                  occurred_at  gloss_qty
0    2016-02-01T19:27:27.000Z         29
1    2016-03-02T15:29:32.000Z         24
2    2016-10-14T23:54:21.000Z         28
3    2015-08-09T18:29:20.000Z         24
4    2016-02-01T20:00:37.000Z         26
5    2016-04-30T07:46:13.000Z         26
6    2016-06-28T06:18:20.000Z         25
7    2016-08-26T16:47:57.000Z         25
8    2016-10-24T21:46:10.000Z         28
9    2016-11-23T04:38:57.000Z         25
10   2016-12-23T13:19:56.000Z         29
11   2014-09-13T05:11:21.000Z         28
12   2014-12-11T10:36:32.000Z         25
13   2015-10-01T15:53:49.000Z         25
14   2016-03-19T07:18:30.000Z         26
15   2016-12-07T06:28:31.000Z         28
16   2016-11-20T03:49:54.000Z         29
17   2015-10-01T22:44:46.000Z         27
18   2016-11-22T08:08:54.000Z         29
19   2016-03-27T11:31:53.000Z         29
20   2016-06-14T11:18:07.000Z         24
21   2014-02-07T21:05:25.000Z         24
22   2014-04-07T10:57:41.000Z         28
23   2014-07-05T04:17:47.000Z         28
24   2015-04-07T13:09:41.000Z         28
25   2015-07-03T18:18:41.000Z         24
26   2015-12-27T19:08:47.000Z         24
27   2016-01-26T03:36:10.000Z         24
28   2016-02-25T13:09:22.000Z         27
29   2016-06-22T02:13:56.000Z         28
..                        ...        ...
454  2015-04-01T08:19:45.000Z         24
455  2016-02-17T22:00:49.000Z         29
456  2016-05-02T14:14:13.000Z         25
457  2016-07-03T03:48:56.000Z         25
458  2016-02-22T09:13:53.000Z         25
459  2016-06-08T06:51:17.000Z         25
460  2014-05-30T19:47:20.000Z         25
461  2015-04-19T12:21:49.000Z         29
462  2016-10-09T07:04:56.000Z         24
463  2014-09-22T04:43:32.000Z         24
464  2015-12-28T09:50:09.000Z         25
465  2016-01-03T10:22:37.000Z         29
466  2016-02-01T02:02:32.000Z         24
467  2014-12-15T23:58:32.000Z         27
468  2016-11-08T15:10:31.000Z         26
469  2015-12-21T05:30:06.000Z         27
470  2015-11-08T09:37:21.000Z         28
471  2016-01-06T08:45:17.000Z         28
472  2014-09-21T17:03:14.000Z         29
473  2015-10-08T19:04:04.000Z         27
474  2014-06-20T05:00:21.000Z         29
475  2016-03-31T05:45:03.000Z         24
476  2014-11-12T20:54:06.000Z         27
477  2015-05-09T01:00:46.000Z         29
478  2015-08-05T23:11:47.000Z         29
479  2016-07-23T14:32:34.000Z         24
480  2014-06-26T04:12:30.000Z         24
481  2014-03-08T15:33:55.000Z         25
482  2014-03-09T07:21:16.000Z         27
483  2015-07-23T22:01:14.000Z         26

[484 rows x 2 columns]

It looks like BETWEEN is inclusive of the start and end values.

In [32]:
# 4 Find all information regarding individuals who were contacted via the 
#   organic or adwords channels, and started their account at any point in 2016, sorted from newest to oldest.
sql_query('SELECT * \
           FROM web_events \
           WHERE channel IN ("organic", "adwords") \
               AND occurred_at BETWEEN "2016-01-01" AND "2017-01-01" \
           ORDER BY occurred_at DESC;')

        id  account_id               occurred_at  channel
0     8493        4141  2016-12-31T16:31:23.000Z  organic
1     5661        1851  2016-12-31T06:55:38.000Z  organic
2     5562        1791  2016-12-31T02:08:50.000Z  adwords
3     7703        3351  2016-12-30T21:06:53.000Z  adwords
4     7921        3521  2016-12-30T20:15:48.000Z  organic
5     6416        2401  2016-12-30T17:51:36.000Z  adwords
6     4553        1151  2016-12-30T15:57:41.000Z  organic
7     8129        3781  2016-12-30T06:52:24.000Z  organic
8     6200        2281  2016-12-30T03:43:11.000Z  adwords
9     6937        2801  2016-12-29T14:51:48.000Z  organic
10    7532        3201  2016-12-29T10:08:28.000Z  adwords
11    7173        2941  2016-12-28T21:46:53.000Z  organic
12    8114        3761  2016-12-28T13:44:22.000Z  adwords
13    4464        1061  2016-12-28T08:16:10.000Z  adwords
14    5267        1611  2016-12-27T03:43:31.000Z  organic
15    5662        1861  2016-12-26T11:17:36.000Z  organic
16    5785        1931  2016-12-26T06:35:15.000Z  adwords
17    7402        3061  2016-12-25T14:38:11.000Z  adwords
18    6412        2391  2016-12-25T11:13:47.000Z  adwords
19    4445        1021  2016-12-25T10:35:26.000Z  organic
20    4618        1191  2016-12-25T10:34:03.000Z  adwords
21    6881        2741  2016-12-24T22:28:04.000Z  adwords
22    8256        3911  2016-12-24T09:53:31.000Z  adwords
23    6818        2711  2016-12-24T01:51:58.000Z  adwords
24    8948        4421  2016-12-22T20:10:57.000Z  organic
25    8191        3891  2016-12-22T14:46:51.000Z  adwords
26    7987        3601  2016-12-22T13:44:54.000Z  adwords
27    8192        3891  2016-12-22T01:53:50.000Z  organic
28    6218        2321  2016-12-21T22:25:34.000Z  adwords
29    8266        3931  2016-12-21T22:00:52.000Z  organic
...    ...         ...                       ...      ...
995   7242        2971  2016-01-19T13:26:22.000Z  organic
996   8342        3991  2016-01-19T01:48:44.000Z  adwords
997   7504        3181  2016-01-18T19:09:39.000Z  organic
998   7628        3261  2016-01-18T07:28:52.000Z  adwords
999   6262        2341  2016-01-18T05:31:59.000Z  organic
1000  4702        1271  2016-01-16T22:48:39.000Z  organic
1001  6963        2841  2016-01-16T20:24:37.000Z  adwords
1002  5834        1981  2016-01-15T20:53:11.000Z  adwords
1003  7775        3411  2016-01-15T03:26:46.000Z  organic
1004  8618        4181  2016-01-12T23:15:45.000Z  organic
1005  5502        1781  2016-01-12T18:53:48.000Z  adwords
1006  5940        2051  2016-01-12T09:27:22.000Z  organic
1007  7503        3181  2016-01-12T00:09:13.000Z  organic
1008  6339        2361  2016-01-11T11:15:09.000Z  adwords
1009  7162        2931  2016-01-11T09:01:08.000Z  adwords
1010  9058        4491  2016-01-11T02:26:45.000Z  adwords
1011  4953        1451  2016-01-10T02:29:48.000Z  adwords
1012  5374        1711  2016-01-09T22:37:56.000Z  organic
1013  5226        1601  2016-01-09T20:18:41.000Z  organic
1014  7106        2881  2016-01-09T18:04:50.000Z  organic
1015  8753        4241  2016-01-09T16:20:50.000Z  organic
1016  7787        3421  2016-01-09T09:37:19.000Z  organic
1017  8372        4031  2016-01-08T11:04:04.000Z  adwords
1018  6307        2351  2016-01-08T07:35:24.000Z  adwords
1019  5641        1851  2016-01-06T13:37:28.000Z  adwords
1020  7846        3471  2016-01-06T08:23:05.000Z  adwords
1021  6567        2541  2016-01-06T00:15:28.000Z  organic
1022  8775        4281  2016-01-04T22:51:01.000Z  adwords
1023  5581        1831  2016-01-02T21:27:39.000Z  organic
1024  4399        1001  2016-01-01T15:45:54.000Z  adwords

[1025 rows x 4 columns]

Note that for dates, have to use the next day, based on how date information is recorded. (Basically it includes the seconds)

#### OR
1. Find list of **orders** ids where either `gloss_qty` or `poster_qty` is greater than 4000. Only include the `id` field in the resulting table.
2. Write a query that returns a list of **orders** where the `standard_qty` is zero and either the `gloss_qty` or `poster_qty` is over 1000.
3. Find all the company names that start with a 'C' or 'W', and the primary contact contains 'ana' or 'Ana', but it doesn't contain 'eana'.

In [33]:
# 1 Find list of orders ids where either gloss_qty or poster_qty is greater 
#   than 4000. Only include the id field.
sql_query('SELECT id \
           FROM orders \
           WHERE gloss_qty > 4000 OR poster_qty > 4000;')

      id
0    362
1    731
2   1191
3   1913
4   1939
5   3778
6   3858
7   3963
8   4016
9   4230
10  4698
11  4942
12  5791
13  6590

In [34]:
# 2 Return a list of orders where the standard_qty is zero and either the 
#   gloss_qty or poster_qty is over 1000.
sql_query('SELECT * \
           FROM orders \
           WHERE standard_qty = 0 AND (gloss_qty > 1000 OR poster_qty > 1000);')

,id,account_id,occurred_at,standard_qty,gloss_qty,poster_qty,total,standard_amt_usd,gloss_amt_usd,poster_amt_usd,total_amt_usd
0,1913,2461,2013-12-29T09:50:38.000Z,0,6450,45,6495,0.0,48310.50,365.40,48675.90
1,4369,1111,2015-11-15T17:47:46.000Z,0,486,2988,3474,0.0,3640.14,24262.56,27902.70
2,4391,1161,2016-06-04T08:58:10.000Z,0,106,2967,3073,0.0,793.94,24092.04,24885.98
3,4420,1191,2016-05-21T23:21:14.000Z,0,43,1448,1491,0.0,322.07,11757.76,12079.83
4,4448,1231,2016-06-25T12:27:15.000Z,0,3178,23,3201,0.0,23803.22,186.76,23989.98
5,4698,1451,2015-02-26T06:13:21.000Z,0,484,4901,5385,0.0,3625.16,39796.12,43421.28
6,4942,1701,2015-09-24T21:02:25.000Z,0,10744,95,10839,0.0,80472.56,771.40,81243.96
7,5032,1831,2016-05-26T17:48:19.000Z,0,1448,287,1735,0.0,10845.52,2330.44,13175.96
8,5191,2051,2015-05-17T14:17:59.000Z,0,1041,0,1041,0.0,7797.09,0.00,7797.09
9,5791,2861,2014-10-24T12:06:22.000Z,0,10,11691,11701,0.0,74.90,94930.92,95005.82
10,5805,2861,2016-09-29T04:51:11.000Z,0,60,3122,3182,0.0,449.40,25350.64,25800.04
11,5895,2931,2016-01-18T09:21:18.000Z,0,519,1315,1834,0.0,3887.31,10677.80,14565.11
12,5933,3001,2016-09-14T05:44:07.000Z,0,2802,63,2865,0.0,20986.98,511.56,21498.54
13,6007,3141,2013-12-08T20:13:49.000Z,0,49,1401,1450,0.0,367.01,11376.12,11743.13
14,6142,3341,2016-11-26T06:56:12.000Z,0,492,1947,2439,0.0,3685.08,15809.64,19494.72
15,6285,3491,2015-02-22T09:54:25.000Z,0,1246,0,1246,0.0,9332.54,0.00,9332.54
16,6332,3571,2016-09-18T15:30:41.000Z,0,51,1752,1803,0.0,381.99,14226.24,14608.23

In [38]:
# 3 Find all the company names that start with a 'C' or 'W', and the primary 
#   contact contains 'ana' or 'Ana', but it doesn't contain 'eana'.
sql_query('SELECT name \
           FROM accounts \
           WHERE (name LIKE "C%" OR name LIKE "W%") \
               AND ((primary_poc LIKE "%ana%" OR primary_poc LIKE "%Ana%") \
               AND primary_poc NOT LIKE "%eana%");')

         name
0  CVS Health
1     Comcast

Notice the brackets used for groupings:
- There are two main conditions about the company name and the point of contact
- Both of these have other conditional statements so they are bracketed
- The OR statement in primary contact is also combined
- Each LIKE statement needs its own column name and search term

### Summary
The order that key words are used and entered does matter. This is the current info that we have:
```sql
SELECT col1, col2
FROM table1
WHERE col3  > 5 AND col4 LIKE '%os%'
ORDER BY col5
LIMIT 10;
```

## SQL Joins
SQL Tables are joined using database keys:
- **primary keys** are unique for every row in a table. These are generally the first column in our database
- **foreign keys** are the **primary key** appearing in another table, which allows the rows to be non-unique

There are three common join statements:
- **JOIN**: an **INNER JOIN** that only pulls data that exists in both tables
- **LEFT JOIN**: a way to pull all of the rows from the table in the FROM even if they do not exist in the JOIN statement
- **RIGHT JOIN**: a way to pull all of the rows from the table in the JOIN even if they do not exist in the FROM statement

More advanced joins include:
- [**UNION** and **UNION ALL**](https://www.w3schools.com/sql/sql_union.asp): Used to combine the result-set of two or more SELECT statements.
**Union**:
```sql
SELECT column_name(s) FROM table1
UNION
SELECT column_name(s) FROM table2;
```
UNION only selects distinct values but UNION ALL allows duplicate values.
- [**CROSS JOIN**](https://www.w3resource.com/sql/joins/cross-join.php): Each of the rows from the first table joins with all of the rows from the second table.
```sql
SELECT * 
FROM table1 
CROSS JOIN table2;
```
- [**SELF JOIN**](https://www.w3schools.com/sql/sql_join_self.asp): is a regular join where the table is joined with itself.
```
SELECT column_name(s)
FROM table1 T1, table1 T2
WHERE condition;
```
**Example**:
```sql
SELECT A.CustomerName AS CustomerName1, B.CustomerName AS CustomerName2, A.City
FROM Customers A, Customers B
WHERE A.CustomerID <> B.CustomerID
AND A.City = B.City 
ORDER BY A.City;
```

There is also the rare:
- [**OUTER JOIN**](https://www.w3resource.com/sql/joins/perform-a-full-outer-join.php): where all values from both tables are preserved. 
```sql
SELECT * 
FROM table1 
FULL OUTER JOIN table2    # FULL OUTER is the same as OUTER
ON table1.column_name=table2.column_name;
```

### First Join

In [39]:
sql_query('SELECT orders.* \
           FROM orders \
           JOIN accounts \
           ON orders.account_id = accounts.id;')

,id,account_id,occurred_at,standard_qty,gloss_qty,poster_qty,total,standard_amt_usd,gloss_amt_usd,poster_amt_usd,total_amt_usd
0,1,1001,2015-10-06T17:31:14.000Z,123,22,24,169,613.77,164.78,194.88,973.43
1,2,1001,2015-11-05T03:34:33.000Z,190,41,57,288,948.10,307.09,462.84,1718.03
2,3,1001,2015-12-04T04:21:55.000Z,85,47,0,132,424.15,352.03,0.00,776.18
3,4,1001,2016-01-02T01:18:24.000Z,144,32,0,176,718.56,239.68,0.00,958.24
4,5,1001,2016-02-01T19:27:27.000Z,108,29,28,165,538.92,217.21,227.36,983.49
5,6,1001,2016-03-02T15:29:32.000Z,103,24,46,173,513.97,179.76,373.52,1067.25
6,7,1001,2016-04-01T11:20:18.000Z,101,33,92,226,503.99,247.17,747.04,1498.20
7,8,1001,2016-05-01T15:55:51.000Z,95,47,151,293,474.05,352.03,1226.12,2052.20
8,9,1001,2016-05-31T21:22:48.000Z,91,16,22,129,454.09,119.84,178.64,752.57
9,10,1001,2016-06-30T12:32:05.000Z,94,46,8,148,469.06,344.54,64.96,878.56
10,11,1001,2016-07-30T03:26:30.000Z,101,36,0,137,503.99,269.64,0.00,773.63
11,12,1001,2016-08-28T07:13:39.000Z,124,33,39,196,618.76,247.17,316.68,1182.61
12,13,1001,2016-09-26T23:28:25.000Z,104,10,44,158,518.96,74.90,357.28,951.14
13,14,1001,2016-10-26T20:31:30.000Z,97,143,54,294,484.03,1071.07,438.48,1993.58
14,15,1001,2016-11-25T23:21:32.000Z,127,39,44,210,633.73,292.11,357.28,1283.12
15,16,1001,2016-12-24T05:53:13.000Z,123,127,19,269,613.77,951.23,154.28,1719.28
16,17,1011,2016-12-21T10:59:34.000Z,527,14,0,541,2629.73,104.86,0.00,2734.59
17,18,1021,2015-10-12T02:21:56.000Z,516,23,0,539,2574.84,172.27,0.00,2747.11
18,19,1021,2015-11-11T07:37:01.000Z,497,61,0,558,2480.03,456.89,0.00,2936.92
19,20,1021,2015-12-11T16:53:18.000Z,483,0,21,504,2410.17,0.00,170.52,2580.69
20,21,1021,2016-01-10T09:29:45.000Z,535,0,34,569,2669.65,0.00,276.08,2945.73
21,22,1021,2016-02-09T00:50:46.000Z,502,4,9,515,2504.98,29.96,73.08,2608.02
22,23,1021,2016-03-10T00:38:52.000Z,555,19,4,578,2769.45,142.31,32.48,2944.24
23,24,1031,2016-12-25T03:54:27.000Z,1148,0,215,1363,5728.52,0.00,1745.80,7474.32
24,25,1041,2016-10-14T23:54:21.000Z,298,28,69,395,1487.02,209.72,560.28,2257.02
25,26,1041,2016-11-13T10:11:52.000Z,307,22,0,329,1531.93,164.78,0.00,1696.71
26,27,1041,2016-12-12T07:50:01.000Z,157,34,21,212,783.43,254.66,170.52,1208.61
27,28,1051,2016-08-02T20:13:27.000Z,505,84,0,589,2519.95,629.16,0.00,3149.11
28,29,1051,2016-09-01T05:38:19.000Z,498,35,9,542,2485.02,262.15,73.08,2820.25
29,30,1051,2016-10-01T00:48:28.000Z,486,0,1,487,2425.14,0.00,8.12,2433.26
...,...,...,...,...,...,...,...,...,...,...,...
6882,6883,4461,2015-12-08T08:20:02.000Z,70,499,263,832,349.30,3737.51,2135.56,6222.37
6883,6884,4461,2016-01-06T23:56:04.000Z,59,499,301,859,294.41,3737.51,2444.12,6476.04
6884,6885,4461,2016-02-04T21:12:41.000Z,52,581,276,909,259.48,4351.69,2241.12,6852.29
6885,6886,4461,2016-06-01T05:36:30.000Z,48,485,226,759,239.52,3632.65,1835.12,5707.29
6886,6887,4461,2016-07-01T11:07:48.000Z,13,343,302,658,64.87,2569.07,2452.24,5086.18
6887,6888,4461,2016-07-30T10:38:37.000Z,52,484,335,871,259.48,3625.16,2720.20,6604.84
6888,6889,4461,2016-08-28T13:11:30.000Z,25,505,287,817,124.75,3782.45,2330.44,6237.64
6889,6890,4461,2016-09-26T08:44:11.000Z,42,538,313,893,209.58,4029.62,2541.56,6780.76
6890,6891,4461,2016-11-24T16:28:38.000Z,50,515,0,565,249.50,3857.35,0.00,4106.85
6891,6892,4461,2016-12-23T17:36:00.000Z,54,453,286,793,269.46,3392.97,2322.32,5984.75
6892,6893,4471,2016-12-05T05:10:54.000Z,0,42,31,73,0.00,314.58,251.72,566.30
6893,6894,4481,2016-10-08T07:38:46.000Z,31,99,0,130,154.69,741.51,0.00,896.20
6894,6895,4481,2016-11-07T12:54:03.000Z,0,110,437,547,0.00,823.90,3548.44,4372.34
6895,6896,4491,2013-12-08T06:34:23.000Z,43,520,242,805,214.57,3894.80,1965.04,6074.41
6896,6897,4491,2014-01-06T08:11:00.000Z,0,512,318,830,0.00,3834.88,2582.16,6417.04
6897,6898,4491,2014-02-04T03:04:08.000Z,34,517,205,756,169.66,3872.33,1664.60,5706.59
6898,6899,4491,2014-03-06T05:22:25.000Z,549,523,245,1317,2739.51,3917.27,1989.40,8646.18
6899,6900,4491,2014-05-05T00:03:19.000Z,33,508,283,824,164.67,3804.92,2297.96,6267.55
6900,6901,4491,2014-07-31T05:05:06.000Z,12,509,262,783,59.88,3812.41,2127.44,5999.73
6901,6902,4491,2014-08-29T17:15:24.000Z,24,520,298,842,119.76,3894.80,2419.76,6434.32
6902,6903,4491,2014-09-28T15:53:06.000Z,52,601,360,1013,259.48,4501.49,2923.20,7684.17
6903,6904,4491,2014-10-27T19:05:05.000Z,54,505,292,851,269.46,3782.45,2371.04,6422.95
6904,6905,4491,2014-12-26T21:39:04.000Z,218,366,283,867,1087.82,2741.34,2297.96,6127.12
6905,6906,4491,2015-01-24T07:15:47.000Z,54,621,282,957,269.46,4651.29,2289.84,7210.59
6906,6907,4491,2015-02-22T07:24:04.000Z,0,499,319,818,0.00,3737.51,2590.28,6327.79
6907,6908,4501,2016-06-29T04:03:39.000Z,11,199,59,269,54.89,1490.51,479.08,2024.48
6908,6909,4501,2016-07-29T19:58:32.000Z,5,91,96,192,24.95,681.59,779.52,1486.06
6909,6910,4501,2016-08-27T00:58:11.000Z,16,94,82,192,79.84,704.06,665.84,1449.74
6910,6911,4501,2016-11-22T06:52:22.000Z,63,67,81,211,314.37,501.83,657.72,1473.92
6911,6912,4501,2016-12-21T13:30:42.000Z,61,150,52,263,304.39,1123.50,422.24,1850.13

In [40]:
sql_query('SELECT * \
           FROM orders;')

,id,account_id,occurred_at,standard_qty,gloss_qty,poster_qty,total,standard_amt_usd,gloss_amt_usd,poster_amt_usd,total_amt_usd
0,1,1001,2015-10-06T17:31:14.000Z,123,22,24,169,613.77,164.78,194.88,973.43
1,2,1001,2015-11-05T03:34:33.000Z,190,41,57,288,948.10,307.09,462.84,1718.03
2,3,1001,2015-12-04T04:21:55.000Z,85,47,0,132,424.15,352.03,0.00,776.18
3,4,1001,2016-01-02T01:18:24.000Z,144,32,0,176,718.56,239.68,0.00,958.24
4,5,1001,2016-02-01T19:27:27.000Z,108,29,28,165,538.92,217.21,227.36,983.49
5,6,1001,2016-03-02T15:29:32.000Z,103,24,46,173,513.97,179.76,373.52,1067.25
6,7,1001,2016-04-01T11:20:18.000Z,101,33,92,226,503.99,247.17,747.04,1498.20
7,8,1001,2016-05-01T15:55:51.000Z,95,47,151,293,474.05,352.03,1226.12,2052.20
8,9,1001,2016-05-31T21:22:48.000Z,91,16,22,129,454.09,119.84,178.64,752.57
9,10,1001,2016-06-30T12:32:05.000Z,94,46,8,148,469.06,344.54,64.96,878.56
10,11,1001,2016-07-30T03:26:30.000Z,101,36,0,137,503.99,269.64,0.00,773.63
11,12,1001,2016-08-28T07:13:39.000Z,124,33,39,196,618.76,247.17,316.68,1182.61
12,13,1001,2016-09-26T23:28:25.000Z,104,10,44,158,518.96,74.90,357.28,951.14
13,14,1001,2016-10-26T20:31:30.000Z,97,143,54,294,484.03,1071.07,438.48,1993.58
14,15,1001,2016-11-25T23:21:32.000Z,127,39,44,210,633.73,292.11,357.28,1283.12
15,16,1001,2016-12-24T05:53:13.000Z,123,127,19,269,613.77,951.23,154.28,1719.28
16,17,1011,2016-12-21T10:59:34.000Z,527,14,0,541,2629.73,104.86,0.00,2734.59
17,18,1021,2015-10-12T02:21:56.000Z,516,23,0,539,2574.84,172.27,0.00,2747.11
18,19,1021,2015-11-11T07:37:01.000Z,497,61,0,558,2480.03,456.89,0.00,2936.92
19,20,1021,2015-12-11T16:53:18.000Z,483,0,21,504,2410.17,0.00,170.52,2580.69
20,21,1021,2016-01-10T09:29:45.000Z,535,0,34,569,2669.65,0.00,276.08,2945.73
21,22,1021,2016-02-09T00:50:46.000Z,502,4,9,515,2504.98,29.96,73.08,2608.02
22,23,1021,2016-03-10T00:38:52.000Z,555,19,4,578,2769.45,142.31,32.48,2944.24
23,24,1031,2016-12-25T03:54:27.000Z,1148,0,215,1363,5728.52,0.00,1745.80,7474.32
24,25,1041,2016-10-14T23:54:21.000Z,298,28,69,395,1487.02,209.72,560.28,2257.02
25,26,1041,2016-11-13T10:11:52.000Z,307,22,0,329,1531.93,164.78,0.00,1696.71
26,27,1041,2016-12-12T07:50:01.000Z,157,34,21,212,783.43,254.66,170.52,1208.61
27,28,1051,2016-08-02T20:13:27.000Z,505,84,0,589,2519.95,629.16,0.00,3149.11
28,29,1051,2016-09-01T05:38:19.000Z,498,35,9,542,2485.02,262.15,73.08,2820.25
29,30,1051,2016-10-01T00:48:28.000Z,486,0,1,487,2425.14,0.00,8.12,2433.26
...,...,...,...,...,...,...,...,...,...,...,...
6882,6883,4461,2015-12-08T08:20:02.000Z,70,499,263,832,349.30,3737.51,2135.56,6222.37
6883,6884,4461,2016-01-06T23:56:04.000Z,59,499,301,859,294.41,3737.51,2444.12,6476.04
6884,6885,4461,2016-02-04T21:12:41.000Z,52,581,276,909,259.48,4351.69,2241.12,6852.29
6885,6886,4461,2016-06-01T05:36:30.000Z,48,485,226,759,239.52,3632.65,1835.12,5707.29
6886,6887,4461,2016-07-01T11:07:48.000Z,13,343,302,658,64.87,2569.07,2452.24,5086.18
6887,6888,4461,2016-07-30T10:38:37.000Z,52,484,335,871,259.48,3625.16,2720.20,6604.84
6888,6889,4461,2016-08-28T13:11:30.000Z,25,505,287,817,124.75,3782.45,2330.44,6237.64
6889,6890,4461,2016-09-26T08:44:11.000Z,42,538,313,893,209.58,4029.62,2541.56,6780.76
6890,6891,4461,2016-11-24T16:28:38.000Z,50,515,0,565,249.50,3857.35,0.00,4106.85
6891,6892,4461,2016-12-23T17:36:00.000Z,54,453,286,793,269.46,3392.97,2322.32,5984.75
6892,6893,4471,2016-12-05T05:10:54.000Z,0,42,31,73,0.00,314.58,251.72,566.30
6893,6894,4481,2016-10-08T07:38:46.000Z,31,99,0,130,154.69,741.51,0.00,896.20
6894,6895,4481,2016-11-07T12:54:03.000Z,0,110,437,547,0.00,823.90,3548.44,4372.34
6895,6896,4491,2013-12-08T06:34:23.000Z,43,520,242,805,214.57,3894.80,1965.04,6074.41
6896,6897,4491,2014-01-06T08:11:00.000Z,0,512,318,830,0.00,3834.88,2582.16,6417.04
6897,6898,4491,2014-02-04T03:04:08.000Z,34,517,205,756,169.66,3872.33,1664.60,5706.59
6898,6899,4491,2014-03-06T05:22:25.000Z,549,523,245,1317,2739.51,3917.27,1989.40,8646.18
6899,6900,4491,2014-05-05T00:03:19.000Z,33,508,283,824,164.67,3804.92,2297.96,6267.55
6900,6901,4491,2014-07-31T05:05:06.000Z,12,509,262,783,59.88,3812.41,2127.44,5999.73
6901,6902,4491,2014-08-29T17:15:24.000Z,24,520,298,842,119.76,3894.80,2419.76,6434.32
6902,6903,4491,2014-09-28T15:53:06.000Z,52,601,360,1013,259.48,4501.49,2923.20,7684.17
6903,6904,4491,2014-10-27T19:05:05.000Z,54,505,292,851,269.46,3782.45,2371.04,6422.95
6904,6905,4491,2014-12-26T21:39:04.000Z,218,366,283,867,1087.82,2741.34,2297.96,6127.12
6905,6906,4491,2015-01-24T07:15:47.000Z,54,621,282,957,269.46,4651.29,2289.84,7210.59
6906,6907,4491,2015-02-22T07:24:04.000Z,0,499,319,818,0.00,3737.51,2590.28,6327.79
6907,6908,4501,2016-06-29T04:03:39.000Z,11,199,59,269,54.89,1490.51,479.08,2024.48
6908,6909,4501,2016-07-29T19:58:32.000Z,5,91,96,192,24.95,681.59,779.52,1486.06
6909,6910,4501,2016-08-27T00:58:11.000Z,16,94,82,192,79.84,704.06,665.84,1449.74
6910,6911,4501,2016-11-22T06:52:22.000Z,63,67,81,211,314.37,501.83,657.72,1473.92
6911,6912,4501,2016-12-21T13:30:42.000Z,61,150,52,263,304.39,1123.50,422.24,1850.13

As I thought, while this is a join statement, it didn't actually produce anything to join because all we selected was everything from **orders** and not anything from **accounts**.

1. Try pulling all the data from the **accounts** table, and all the data from the **orders** table.
2. Try pulling `standard_qty`, `gloss_qty`, and `poster_qty` from the **orders** table, and the `website` and the `primary_poc` from the **accounts** table.

In [41]:
# 1 Pulling all the data from the accounts table and from the orders table
sql_query('SELECT * \
           FROM orders \
           JOIN accounts \
           ON orders.account_id = accounts.id;')

,id,account_id,occurred_at,standard_qty,gloss_qty,poster_qty,total,standard_amt_usd,gloss_amt_usd,poster_amt_usd,total_amt_usd,id,name,website,lat,long,primary_poc,sales_rep_id
0,1,1001,2015-10-06T17:31:14.000Z,123,22,24,169,613.77,164.78,194.88,973.43,1001,Walmart,www.walmart.com,40.238496,-75.103297,Tamara Tuma,321500
1,2,1001,2015-11-05T03:34:33.000Z,190,41,57,288,948.10,307.09,462.84,1718.03,1001,Walmart,www.walmart.com,40.238496,-75.103297,Tamara Tuma,321500
2,3,1001,2015-12-04T04:21:55.000Z,85,47,0,132,424.15,352.03,0.00,776.18,1001,Walmart,www.walmart.com,40.238496,-75.103297,Tamara Tuma,321500
3,4,1001,2016-01-02T01:18:24.000Z,144,32,0,176,718.56,239.68,0.00,958.24,1001,Walmart,www.walmart.com,40.238496,-75.103297,Tamara Tuma,321500
4,5,1001,2016-02-01T19:27:27.000Z,108,29,28,165,538.92,217.21,227.36,983.49,1001,Walmart,www.walmart.com,40.238496,-75.103297,Tamara Tuma,321500
5,6,1001,2016-03-02T15:29:32.000Z,103,24,46,173,513.97,179.76,373.52,1067.25,1001,Walmart,www.walmart.com,40.238496,-75.103297,Tamara Tuma,321500
6,7,1001,2016-04-01T11:20:18.000Z,101,33,92,226,503.99,247.17,747.04,1498.20,1001,Walmart,www.walmart.com,40.238496,-75.103297,Tamara Tuma,321500
7,8,1001,2016-05-01T15:55:51.000Z,95,47,151,293,474.05,352.03,1226.12,2052.20,1001,Walmart,www.walmart.com,40.238496,-75.103297,Tamara Tuma,321500
8,9,1001,2016-05-31T21:22:48.000Z,91,16,22,129,454.09,119.84,178.64,752.57,1001,Walmart,www.walmart.com,40.238496,-75.103297,Tamara Tuma,321500
9,10,1001,2016-06-30T12:32:05.000Z,94,46,8,148,469.06,344.54,64.96,878.56,1001,Walmart,www.walmart.com,40.238496,-75.103297,Tamara Tuma,321500
10,11,1001,2016-07-30T03:26:30.000Z,101,36,0,137,503.99,269.64,0.00,773.63,1001,Walmart,www.walmart.com,40.238496,-75.103297,Tamara Tuma,321500
11,12,1001,2016-08-28T07:13:39.000Z,124,33,39,196,618.76,247.17,316.68,1182.61,1001,Walmart,www.walmart.com,40.238496,-75.103297,Tamara Tuma,321500
12,13,1001,2016-09-26T23:28:25.000Z,104,10,44,158,518.96,74.90,357.28,951.14,1001,Walmart,www.walmart.com,40.238496,-75.103297,Tamara Tuma,321500
13,14,1001,2016-10-26T20:31:30.000Z,97,143,54,294,484.03,1071.07,438.48,1993.58,1001,Walmart,www.walmart.com,40.238496,-75.103297,Tamara Tuma,321500
14,15,1001,2016-11-25T23:21:32.000Z,127,39,44,210,633.73,292.11,357.28,1283.12,1001,Walmart,www.walmart.com,40.238496,-75.103297,Tamara Tuma,321500
15,16,1001,2016-12-24T05:53:13.000Z,123,127,19,269,613.77,951.23,154.28,1719.28,1001,Walmart,www.walmart.com,40.238496,-75.103297,Tamara Tuma,321500
16,17,1011,2016-12-21T10:59:34.000Z,527,14,0,541,2629.73,104.86,0.00,2734.59,1011,Exxon Mobil,www.exxonmobil.com,41.169156,-73.849374,Sung Shields,321510
17,18,1021,2015-10-12T02:21:56.000Z,516,23,0,539,2574.84,172.27,0.00,2747.11,1021,Apple,www.apple.com,42.290495,-76.084009,Jodee Lupo,321520
18,19,1021,2015-11-11T07:37:01.000Z,497,61,0,558,2480.03,456.89,0.00,2936.92,1021,Apple,www.apple.com,42.290495,-76.084009,Jodee Lupo,321520
19,20,1021,2015-12-11T16:53:18.000Z,483,0,21,504,2410.17,0.00,170.52,2580.69,1021,Apple,www.apple.com,42.290495,-76.084009,Jodee Lupo,321520
20,21,1021,2016-01-10T09:29:45.000Z,535,0,34,569,2669.65,0.00,276.08,2945.73,1021,Apple,www.apple.com,42.290495,-76.084009,Jodee Lupo,321520
21,22,1021,2016-02-09T00:50:46.000Z,502,4,9,515,2504.98,29.96,73.08,2608.02,1021,Apple,www.apple.com,42.290495,-76.084009,Jodee Lupo,321520
22,23,1021,2016-03-10T00:38:52.000Z,555,19,4,578,2769.45,142.31,32.48,2944.24,1021,Apple,www.apple.com,42.290495,-76.084009,Jodee Lupo,321520
23,24,1031,2016-12-25T03:54:27.000Z,1148,0,215,1363,5728.52,0.00,1745.80,7474.32,1031,Berkshire Hathaway,www.berkshirehathaway.com,40.949021,-75.763898,Serafina Banda,321530
24,25,1041,2016-10-14T23:54:21.000Z,298,28,69,395,1487.02,209.72,560.28,2257.02,1041,McKesson,www.mckesson.com,42.217093,-75.284998,Angeles Crusoe,321540
25,26,1041,2016-11-13T10:11:52.000Z,307,22,0,329,1531.93,164.78,0.00,1696.71,1041,McKesson,www.mckesson.com,42.217093,-75.284998,Angeles Crusoe,321540
26,27,1041,2016-12-12T07:50:01.000Z,157,34,21,212,783.43,254.66,170.52,1208.61,1041,McKesson,www.mckesson.com,42.217093,-75.284998,Angeles Crusoe,321540
27,28,1051,2016-08-02T20:13:27.000Z,505,84,0,589,2519.95,629.16,0.00,3149.11,1051,UnitedHealth Group,www.unitedhealthgroup.com,40.087925,-75.575694,Savanna Gayman,321550
28,29,1051,2016-09-01T05:38:19.000Z,498,35,9,542,2485.02,262.15,73.08,2820.25,1051,UnitedHealth Group,www.unitedhealthgroup.com,40.087925,-75.575694,Savanna Gayman,321550
29,30,1051,2016-10-01T00:48:28.000Z,486,0,1,487,2425.14,0.00,8.12,2433.26,1051,UnitedHealth Group,www.unitedhealthgroup.com,40.087925,-75.575694,Savanna Gayman,321550
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
6882,6883,4461,2015-12-08T08:20:02.000Z,70,499,263,832,349.30,3737.51,2135.56,6222.37,4461,KKR,www.kkr.com,45.545353,-122.655247,Buffy Azure,321970
6883,6884,4461,2016-01-06T23:56:04.000Z,59,499,301,859,294.41,3737.51,2444.12,6476.04,4461,KKR,www.kkr.com,45.545353,-122.655247,Buffy Azure,321970
6884,6885,4461,2016-02-04T21:12:41.000Z,52,581,276,909,259.48,4351.69,2241.12,6852.29,4461,KKR,www.kkr.com,45.545353,-122.655247,Buffy Azure,321970
6885,6886,4461,2016-06-01T05:36:30.000Z,48,485,226,759,239.52,3632.65,1835.12,5707.29,4461,KKR,www.kkr.com,45.545353,-122.655247,Buffy Azure,321970
6886,6887,4461,2016-07-01T11:07:48.000Z,13,343,302,658,64.87,2569.07,2452.24,5086.18,4461,KKR,www.kkr.com,45.545353,-122.655247,Buffy Azure,321970
6887,6888,4461,2016-07-30T10:38:37.000Z,52,484,335,871,259.48,3625.16,2720.20,6604.84,4461,KKR,www.kkr.com,45.545353,-122.655247,Buffy Azure,321970
6888,6889,4461,2016-08-28T13:11:30.000Z,25,505,287,817,124.75,3782.45,2330.44,6237.64,4461,KKR,www.kkr.com,45.545353,-122.655247,Buffy Azure,321970
6889,6890,4461,2016-09-26T08:44:11.000Z,42,538,313,893,209.58,4029.62,2541.56,6780.76,4461,KKR,www.kkr.com,45.545353,-122.655247,Buffy Azure,321970
6890,6891,4461,2016-11-24T16:28:38.000Z,50,515,0,565,249.50,3857.35,0.00,4106.85,4461,KKR,www.kkr.com,45.545353,-122.655247,Buffy Azure,321970
6891,6892,4461,2016-12-23T17:36:00.000Z,54,453,286,793,269.46,3392.97,2322.32,5984.75,4461,KKR,www.kkr.com,45.545353,-122.655247,Buffy Azure,321970
6892,6893,4471,2016-12-05T05:10:54.000Z,0,42,31,73,0.00,314.58,251.72,566.30,4471,Oneok,www.oneok.com,45.513513,-122.681500,Esta Engelhardt,321960
6893,6894,4481,2016-10-08T07:38:46.000Z,31,99,0,130,154.69,741.51,0.00,896.20,4481,Newmont Mining,www.newmont.com,45.494117,-122.669460,Khadijah Riemann,321970
6894,6895,4481,2016-11-07T12:54:03.000Z,0,110,437,547,0.00,823.90,3548.44,4372.34,4481,Newmont Mining,www.newmont.com,45.494117,-122.669460,Khadijah Riemann,321970
6895,6896,4491,2013-12-08T06:34:23.000Z,43,520,242,805,214.57,3894.80,1965.04,6074.41,4491,PPL,www.pplweb.com,45.491720,-122.671880,Deanne Hertlein,321960
6896,6897,4491,2014-01-06T08:11:00.000Z,0,512,318,830,0.00,3834.88,2582.16,6417.04,4491,PPL,www.pplweb.com,45.491720,-122.671880,Deanne Hertlein,321960
6897,6898,4491,2014-02-04T03:04:08.000Z,34,517,205,756,169.66,3872.33,1664.60,5706.59,4491,PPL,www.pplweb.com,45.491720,-122.671880,Deanne Hertlein,321960
6898,6899,4491,2014-03-06T05:22:25.000Z,549,523,245,1317,2739.51,3917.27,1989.40,8646.18,4491,PPL,www.pplweb.com,45.491720,-122.671880,Deanne Hertlein,321960
6899,6900,4491,2014-05-05T00:03:19.000Z,33,508,283,824,164.67,3804.92,2297.96,6267.55,4491,PPL,www.pplweb.com,45.491720,-122.671880,Deanne Hertlein,321960
6900,6901,4491,2014-07-31T05:05:06.000Z,12,509,262,783,59.88,3812.41,2127.44,5999.73,4491,PPL,www.pplweb.com,45.491720,-122.671880,Deanne Hertlein,321960
6901,6902,4491,2014-08-29T17:15:24.000Z,24,520,298,842,119.76,3894.80,2419.76,6434.32,4491,PPL,www.pplweb.com,45.491720,-122.671880,Deanne Hertlein,321960
6902,6903,4491,2014-09-28T15:53:06.000Z,52,601,360,1013,259.48,4501.49,2923.20,7684.17,4491,PPL,www.pplweb.com,45.491720,-122.671880,Deanne Hertlein,321960
6903,6904,4491,2014-10-27T19:05:05.000Z,54,505,292,851,269.46,3782.45,2371.04,6422.95,4491,PPL,www.pplweb.com,45.491720,-122.671880,Deanne Hertlein,321960
6904,6905,4491,2014-12-26T21:39:04.000Z,218,366,283,867,1087.82,2741.34,2297.96,6127.12,4491,PPL,www.pplweb.com,45.491720,-122.671880,Deanne Hertlein,321960
6905,6906,4491,2015-01-24T07:15:47.000Z,54,621,282,957,269.46,4651.29,2289.84,7210.59,4491,PPL,www.pplweb.com,45.491720,-122.671880,Deanne Hertlein,321960
6906,6907,4491,2015-02-22T07:24:04.000Z,0,499,319,818,0.00,3737.51,2590.28,6327.79,4491,PPL,www.pplweb.com,45.491720,-122.671880,Deanne Hertlein,321960
6907,6908,4501,2016-06-29T04:03:39.000Z,11,199,59,269,54.89,1490.51,479.08,2024.48,4501,SpartanNash,www.spartannash.com,45.555651,-122.657145,Jewell Likes,321970
6908,6909,4501,2016-07-29T19:58:32.000Z,5,91,96,192,24.95,681.59,779.52,1486.06,4501,SpartanNash,www.spartannash.com,45.555651,-122.657145,Jewell Likes,321970
6909,6910,4501,2016-08-27T00:58:11.000Z,16,94,82,192,79.84,704.06,665.84,1449.74,4501,SpartanNash,www.spartannash.com,45.555651,-122.657145,Jewell Likes,321970
6910,6911,4501,2016-11-22T06:52:22.000Z,63,67,81,211,314.37,501.83,657.72,1473.92,4501,SpartanNash,www.spartannash.com,45.555651,-122.657145,Jewell Likes,321970
6911,6912,4501,2016-12-21T13:30:42.000Z,61,150,52,263,304.39,1123.50,422.24,1850.13,4501,SpartanNash,www.spartannash.com,45.555651,-122.657145,Jewell Likes,321970

In [42]:
# 2 Pull standard_qty, gloss_qty,poster_qty, the website and the primary_poc
sql_query('SELECT orders.standard_qty, orders.gloss_qty, orders.poster_qty, \
                  accounts.website, accounts.primary_poc \
           FROM orders \
           JOIN accounts \
           ON orders.account_id = accounts.id;')

,standard_qty,gloss_qty,poster_qty,website,primary_poc
0,123,22,24,www.walmart.com,Tamara Tuma
1,190,41,57,www.walmart.com,Tamara Tuma
2,85,47,0,www.walmart.com,Tamara Tuma
3,144,32,0,www.walmart.com,Tamara Tuma
4,108,29,28,www.walmart.com,Tamara Tuma
5,103,24,46,www.walmart.com,Tamara Tuma
6,101,33,92,www.walmart.com,Tamara Tuma
7,95,47,151,www.walmart.com,Tamara Tuma
8,91,16,22,www.walmart.com,Tamara Tuma
9,94,46,8,www.walmart.com,Tamara Tuma
10,101,36,0,www.walmart.com,Tamara Tuma
11,124,33,39,www.walmart.com,Tamara Tuma
12,104,10,44,www.walmart.com,Tamara Tuma
13,97,143,54,www.walmart.com,Tamara Tuma
14,127,39,44,www.walmart.com,Tamara Tuma
15,123,127,19,www.walmart.com,Tamara Tuma
16,527,14,0,www.exxonmobil.com,Sung Shields
17,516,23,0,www.apple.com,Jodee Lupo
18,497,61,0,www.apple.com,Jodee Lupo
19,483,0,21,www.apple.com,Jodee Lupo
20,535,0,34,www.apple.com,Jodee Lupo
21,502,4,9,www.apple.com,Jodee Lupo
22,555,19,4,www.apple.com,Jodee Lupo
23,1148,0,215,www.berkshirehathaway.com,Serafina Banda
24,298,28,69,www.mckesson.com,Angeles Crusoe
25,307,22,0,www.mckesson.com,Angeles Crusoe
26,157,34,21,www.mckesson.com,Angeles Crusoe
27,505,84,0,www.unitedhealthgroup.com,Savanna Gayman
28,498,35,9,www.unitedhealthgroup.com,Savanna Gayman
29,486,0,1,www.unitedhealthgroup.com,Savanna Gayman
...,...,...,...,...,...
6882,70,499,263,www.kkr.com,Buffy Azure
6883,59,499,301,www.kkr.com,Buffy Azure
6884,52,581,276,www.kkr.com,Buffy Azure
6885,48,485,226,www.kkr.com,Buffy Azure
6886,13,343,302,www.kkr.com,Buffy Azure
6887,52,484,335,www.kkr.com,Buffy Azure
6888,25,505,287,www.kkr.com,Buffy Azure
6889,42,538,313,www.kkr.com,Buffy Azure
6890,50,515,0,www.kkr.com,Buffy Azure
6891,54,453,286,www.kkr.com,Buffy Azure
6892,0,42,31,www.oneok.com,Esta Engelhardt
6893,31,99,0,www.newmont.com,Khadijah Riemann
6894,0,110,437,www.newmont.com,Khadijah Riemann
6895,43,520,242,www.pplweb.com,Deanne Hertlein
6896,0,512,318,www.pplweb.com,Deanne Hertlein
6897,34,517,205,www.pplweb.com,Deanne Hertlein
6898,549,523,245,www.pplweb.com,Deanne Hertlein
6899,33,508,283,www.pplweb.com,Deanne Hertlein
6900,12,509,262,www.pplweb.com,Deanne Hertlein
6901,24,520,298,www.pplweb.com,Deanne Hertlein
6902,52,601,360,www.pplweb.com,Deanne Hertlein
6903,54,505,292,www.pplweb.com,Deanne Hertlein
6904,218,366,283,www.pplweb.com,Deanne Hertlein
6905,54,621,282,www.pplweb.com,Deanne Hertlein
6906,0,499,319,www.pplweb.com,Deanne Hertlein
6907,11,199,59,www.spartannash.com,Jewell Likes
6908,5,91,96,www.spartannash.com,Jewell Likes
6909,16,94,82,www.spartannash.com,Jewell Likes
6910,63,67,81,www.spartannash.com,Jewell Likes
6911,61,150,52,www.spartannash.com,Jewell Likes

When making joins, the entity relationship diagram (ERD) is very helpful. For the current database, it looks like this:

![title](erd.png)

It's possible to see how the primary kyes are unique to each table but my contain keys (foreign keys) from other tables, which enables joining.

**Quiz Questions**
1. Provide a table for all **web_events** associated with account **name** of `Walmart`. There should be three columns. Be sure to include the **primary_poc**, time of the event, and the **channel** for each event. Additionally, you might choose to add a fourth column to assure only Walmart events were chosen. 
2. Provide a table that provides the **region** for each **sales_rep** along with their associated **accounts**. Your final table should include three columns: the region **name**, the sales rep **name**, and the account **name**. Sort the accounts alphabetically (A-Z) according to account name. 
3. Provide the **name** for each **region** for every **order**, as well as the account **name** and the **unit price** they paid (total_amt_usd/total) for the order. Your final table should have 3 columns: **region name**, **account name**, and **unit price**. A few accounts have 0 for **total**, so I divided by (total + 0.01) to assure not dividing by zero.

In [48]:
# 1 Provide a table for all web_events associated with account name of Walmart
#   Include the primary_poc, time of the event, and the channel for each event
sql_query('SELECT w.occurred_at, w.channel, a.primary_poc \
           FROM web_events w \
           JOIN accounts a \
           ON w.account_id = a.id \
           WHERE a.name = "Walmart";')

                 occurred_at   channel  primary_poc
0   2015-10-06T04:22:11.000Z  facebook  Tamara Tuma
1   2015-10-06T17:13:58.000Z    direct  Tamara Tuma
2   2015-10-22T05:02:47.000Z   organic  Tamara Tuma
3   2015-10-22T14:04:20.000Z   adwords  Tamara Tuma
4   2015-11-05T03:08:26.000Z    direct  Tamara Tuma
5   2015-11-05T17:18:54.000Z    direct  Tamara Tuma
6   2015-12-04T03:57:24.000Z    direct  Tamara Tuma
7   2015-12-11T08:44:16.000Z    direct  Tamara Tuma
8   2016-01-01T15:45:54.000Z   adwords  Tamara Tuma
9   2016-01-02T00:55:03.000Z    direct  Tamara Tuma
10  2016-01-13T19:31:14.000Z    direct  Tamara Tuma
11  2016-02-01T19:02:33.000Z    direct  Tamara Tuma
12  2016-02-07T17:44:10.000Z   adwords  Tamara Tuma
13  2016-02-27T15:27:22.000Z   organic  Tamara Tuma
14  2016-03-02T15:15:22.000Z    direct  Tamara Tuma
15  2016-03-17T19:54:58.000Z   twitter  Tamara Tuma
16  2016-04-01T10:58:55.000Z    direct  Tamara Tuma
17  2016-04-05T03:02:52.000Z   organic  Tamara Tuma
18  2016-04-17T16:41:02.000Z   organic  Tamara Tuma
19  2016-05-01T14:26:40.000Z    direct  Tamara Tuma
20  2016-05-01T15:26:44.000Z    direct  Tamara Tuma
21  2016-05-07T02:28:31.000Z    banner  Tamara Tuma
22  2016-05-21T16:22:01.000Z   organic  Tamara Tuma
23  2016-05-31T20:53:47.000Z    direct  Tamara Tuma
24  2016-06-02T04:41:31.000Z  facebook  Tamara Tuma
25  2016-06-22T13:48:53.000Z   adwords  Tamara Tuma
26  2016-06-30T12:09:45.000Z    direct  Tamara Tuma
27  2016-07-12T22:43:02.000Z    banner  Tamara Tuma
28  2016-07-26T11:29:09.000Z    direct  Tamara Tuma
29  2016-07-26T21:08:52.000Z    banner  Tamara Tuma
30  2016-07-30T03:06:26.000Z    direct  Tamara Tuma
31  2016-08-12T09:31:22.000Z   organic  Tamara Tuma
32  2016-08-28T06:42:42.000Z    direct  Tamara Tuma
33  2016-09-01T18:33:56.000Z    direct  Tamara Tuma
34  2016-09-11T17:06:53.000Z   adwords  Tamara Tuma
35  2016-09-26T23:14:59.000Z    direct  Tamara Tuma
36  2016-10-26T20:21:09.000Z    direct  Tamara Tuma
37  2016-11-25T22:52:29.000Z    direct  Tamara Tuma
38  2016-12-24T05:35:14.000Z    direct  Tamara Tuma

In [51]:
# 2 Provide the region for each sales_rep along with their associated accounts.
#   Sort account name alphabetically.
sql_query('SELECT r.name region_name, sr.name sales_rep, a.name account \
           FROM region r\
           JOIN sales_reps sr\
           ON r.id = sr.region_id \
           JOIN accounts a\
           ON a.sales_rep_id = sr.id \
           ORDER BY account;')

    region_name            sales_rep                          account
0     Northeast         Sibyl Lauria                               3M
1     Southeast    Earlie Schleusner                              ADP
2     Southeast          Moon Torian                            AECOM
3     Southeast       Calvin Ollison                              AES
4     Northeast          Elba Felder                              AIG
5     Northeast       Necole Victory                             AT&T
6       Midwest          Julie Starr                           AbbVie
7       Midwest          Chau Rowles              Abbott Laboratories
8          West    Marquetta Laycock               Advance Auto Parts
9     Northeast        Renetta Carew                            Aetna
10      Midwest         Cliff Meints                            Aflac
11         West  Georgianna Chisholm         Air Products & Chemicals
12      Midwest          Chau Rowles                            Alcoa
13    Northeast        Julia Behrman                         Allstate
14         West  Georgianna Chisholm                   Ally Financial
15    Northeast            Tia Amato                         Alphabet
16      Midwest      Charles Bidwell                     Altria Group
17    Northeast         Nakesha Renn                       Amazon.com
18    Northeast        Samuel Racine          American Airlines Group
19    Southeast    Earlie Schleusner          American Electric Power
20    Northeast        Julia Behrman                 American Express
21         West         Hilma Busick  American Family Insurance Group
22    Southeast        Vernita Plump             Ameriprise Financial
23    Northeast        Ayesha Monica                AmerisourceBergen
24      Midwest         Delilah Krum                            Amgen
25         West  Georgianna Chisholm               Anadarko Petroleum
26    Northeast        Ayesha Monica                           Anthem
27    Northeast      Michel Averette                            Apple
28         West      Arica Stoltzfus                Applied Materials
29    Southeast        Vernita Plump                          Aramark
..          ...                  ...                              ...
321        West    Marquetta Laycock             United Natural Foods
322   Southeast    Earlie Schleusner              United States Steel
323   Northeast      Michel Averette              United Technologies
324   Northeast          Lavera Oles               UnitedHealth Group
325        West      Arica Stoltzfus                           Univar
326        West          Dawna Agnew        Universal Health Services
327        West      Arica Stoltzfus                       Unum Group
328   Southeast          Maren Musto                               VF
329   Northeast    Ernestine Pickron                    Valero Energy
330        West         Elwood Shutt                          Veritiv
331   Northeast          Retha Sears                          Verizon
332   Southeast       Babette Soukup                           Viacom
333   Southeast          Nelle Meaux                             Visa
334        West         Brandie Riva                   Voya Financial
335        West      Arica Stoltzfus                    W.W. Grainger
336   Northeast        Elna Condello         Walgreens Boots Alliance
337   Northeast        Samuel Racine                          Walmart
338   Southeast            Saran Ram                 Waste Management
339   Southeast      Derrick Boggess            WellCare Health Plans
340   Northeast          Lavera Oles                      Wells Fargo
341        West        Soraya Fulton                         WestRock
342   Southeast          Nelle Meaux                  Western Digital
343        West       Micha Woodford                 Western Refining
344     Midwest      Charles Bidwell                        Whirlpool
345   Southeast            Saran Ram               Whole Foods Market
346   Northeast       Necole Victory              World Fuel Services
347        West  Maryanna Fiorentino                      Xcel Energy
348     Midwest         Cliff Meints                            Xerox
349   Southeast          Maren Musto                       Yum Brands
350        West          Dawna Agnew                             eBay

[351 rows x 3 columns]

In [53]:
# 3 Provide the name for each region for every order, as well as the account 
#   name and the unit price they paid.
sql_query('SELECT r.name region, a.name account, \
                  o.total_amt_usd/(o.total + 0.01) unit_price \
           FROM region r \
           JOIN sales_reps sr \
           ON r.id = sr.region_id \
           JOIN accounts a \
           ON a.sales_rep_id = sr.id \
           JOIN orders o \
           ON o.account_id = a.id;')

         region                  account  unit_price
0     Northeast                  Walmart    5.833424
1     Northeast                  Walmart    5.879706
2     Northeast                  Walmart    5.646522
3     Northeast                  Walmart    5.935815
4     Northeast                  Walmart    6.019492
5     Northeast                  Walmart    5.960184
6     Northeast                  Walmart    5.759600
7     Northeast                  Walmart    6.168719
8     Northeast                  Walmart    5.444236
9     Northeast                  Walmart    6.033417
10    Northeast                  Walmart    6.109804
11    Northeast                  Walmart    6.628910
12    Northeast                  Walmart    6.391138
13    Northeast                  Walmart    5.965175
14    Northeast                  Walmart    7.003857
15    Northeast                  Walmart    6.780654
16    Northeast                  Walmart    6.576261
17    Northeast                  Walmart    6.693799
18    Northeast                  Walmart    6.628009
19    Northeast                  Walmart    6.584865
20    Northeast                  Walmart    6.670464
21    Northeast                  Walmart    6.635718
22    Northeast                  Walmart    6.629155
23    Northeast                  Walmart    6.599534
24    Northeast                  Walmart    6.654672
25    Northeast                  Walmart    6.599887
26    Northeast                  Walmart    6.569825
27    Northeast                  Walmart    6.685563
28    Northeast  Express Scripts Holding    5.454423
29    Northeast  Express Scripts Holding    5.241451
...         ...                      ...         ...
6882       West                     eBay    7.180694
6883       West                  Autoliv    5.203256
6884       West                  Autoliv    5.564753
6885       West                  Autoliv    7.585642
6886       West       HD Supply Holdings    6.332270
6887       West       HD Supply Holdings    6.190146
6888       West       HD Supply Holdings    5.711799
6889       West       HD Supply Holdings    6.089025
6890       West       HD Supply Holdings    5.951930
6891       West       HD Supply Holdings    6.616061
6892       West       HD Supply Holdings    5.167339
6893       West       HD Supply Holdings    6.561197
6894       West       HD Supply Holdings    6.544104
6895       West       HD Supply Holdings    6.582565
6896       West       HD Supply Holdings    6.514029
6897       West       HD Supply Holdings    6.603513
6898       West             Pacific Life    7.111389
6899       West             Pacific Life    7.742934
6900       West             Pacific Life    6.855753
6901       West             Pacific Life    7.489040
6902       West             Pacific Life    7.682929
6903       West             Pacific Life    5.050504
6904       West             Pacific Life    5.031916
6905       West             Pacific Life    5.169794
6906       West             Pacific Life    5.125691
6907       West             Pacific Life    5.231985
6908       West             Pacific Life    5.048424
6909       West             Pacific Life    5.136665
6910       West             Pacific Life    8.063023
6911       West                     Ball    5.446938

[6912 rows x 3 columns]

### Left & Right Joins
When using LEFT and RIGHT JOINs, the order in which information is added because important. The table that is referenced in the FROM statement will be left table and the table referenced in the JOIN statement is the right table. Essentially the order here can be reversed to get the same result with a swapped sign so it is less common to see RIGHT JOINs.

Additional filtering can be completed with JOINs by combining AND with the join. 

For example:
```sql
SELECT orders.*, accounts.*
FROM orders
LEFT JOIN accounts
ON orders.account_id = accounts.id
AND accounts.sales_rep_id = 321500    # Using WHERE statement is equivalent
```

1. Provide a table that provides the **region** for each **sales_rep** along with their associated **accounts**. This time only for the `Midwest` region. Your final table should include three columns: the region **name**, the sales rep **name**, and the account **name**. Sort the accounts alphabetically (A-Z) according to account name.
2. Provide a table that provides the **region** for each **sales_rep** along with their associated **accounts**. This time only for accounts where the sales rep has a first name starting with `S` and in the `Midwest` region. Your final table should include three columns: the region **name**, the sales rep **name**, and the account **name**. Sort the accounts alphabetically (A-Z) according to account name. 
3. Provide a table that provides the **region** for each **sales_rep** along with their associated **accounts**. This time only for accounts where the sales rep has a last name starting with `K` and in the `Midwest` region. Your final table should include three columns: the region **name**, the sales rep **name**, and the account **name**. Sort the accounts alphabetically (A-Z) according to account name.
4. Provide the **name** for each region for every order, as well as the account **name** and the **unit price** they paid (total_amt_usd/total) for the order. However, you should only provide the results if the **standard order quantity** exceeds `100`. Your final table should have 3 columns: region **name**, account **name**, and **unit price**. In order to avoid a division by zero error, adding .01 to the denominator here is helpful total_amt_usd/(total+0.01). 
5. Provide the **name** for each region for every **order**, as well as the account **name** and the **unit price** they paid (total_amt_usd/total) for the order. However, you should only provide the results if the **standard order quantity** exceeds `100` and the **poster order quantity** exceeds `50`. Your final table should have 3 columns: region **name**, account **name**, and **unit price**. _Sort_ for the smallest unit price first. In order to avoid a division by zero error, adding .01 to the denominator here is helpful (total_amt_usd/(total+0.01).

In [55]:
# 1 Provide a table that provides the region for each sales_rep along with 
#   their associated accounts. Only for Midwest, sort accounts alphabetically.
sql_query('SELECT r.name region, sr.name sales_rep, a.name account \
           FROM sales_reps sr \
           LEFT JOIN region r \
           ON sr.region_id = r.id \
           AND r.name = "Midwest" \
           LEFT JOIN accounts a \
           ON sr.id = a.sales_rep_id \
           ORDER BY account;')

      region            sales_rep                          account
0       None         Sibyl Lauria                               3M
1       None    Earlie Schleusner                              ADP
2       None          Moon Torian                            AECOM
3       None       Calvin Ollison                              AES
4       None          Elba Felder                              AIG
5       None       Necole Victory                             AT&T
6    Midwest          Julie Starr                           AbbVie
7    Midwest          Chau Rowles              Abbott Laboratories
8       None    Marquetta Laycock               Advance Auto Parts
9       None        Renetta Carew                            Aetna
10   Midwest         Cliff Meints                            Aflac
11      None  Georgianna Chisholm         Air Products & Chemicals
12   Midwest          Chau Rowles                            Alcoa
13      None        Julia Behrman                         Allstate
14      None  Georgianna Chisholm                   Ally Financial
15      None            Tia Amato                         Alphabet
16   Midwest      Charles Bidwell                     Altria Group
17      None         Nakesha Renn                       Amazon.com
18      None        Samuel Racine          American Airlines Group
19      None    Earlie Schleusner          American Electric Power
20      None        Julia Behrman                 American Express
21      None         Hilma Busick  American Family Insurance Group
22      None        Vernita Plump             Ameriprise Financial
23      None        Ayesha Monica                AmerisourceBergen
24   Midwest         Delilah Krum                            Amgen
25      None  Georgianna Chisholm               Anadarko Petroleum
26      None        Ayesha Monica                           Anthem
27      None      Michel Averette                            Apple
28      None      Arica Stoltzfus                Applied Materials
29      None        Vernita Plump                          Aramark
..       ...                  ...                              ...
321     None    Marquetta Laycock             United Natural Foods
322     None    Earlie Schleusner              United States Steel
323     None      Michel Averette              United Technologies
324     None          Lavera Oles               UnitedHealth Group
325     None      Arica Stoltzfus                           Univar
326     None          Dawna Agnew        Universal Health Services
327     None      Arica Stoltzfus                       Unum Group
328     None          Maren Musto                               VF
329     None    Ernestine Pickron                    Valero Energy
330     None         Elwood Shutt                          Veritiv
331     None          Retha Sears                          Verizon
332     None       Babette Soukup                           Viacom
333     None          Nelle Meaux                             Visa
334     None         Brandie Riva                   Voya Financial
335     None      Arica Stoltzfus                    W.W. Grainger
336     None        Elna Condello         Walgreens Boots Alliance
337     None        Samuel Racine                          Walmart
338     None            Saran Ram                 Waste Management
339     None      Derrick Boggess            WellCare Health Plans
340     None          Lavera Oles                      Wells Fargo
341     None        Soraya Fulton                         WestRock
342     None          Nelle Meaux                  Western Digital
343     None       Micha Woodford                 Western Refining
344  Midwest      Charles Bidwell                        Whirlpool
345     None            Saran Ram               Whole Foods Market
346     None       Necole Victory              World Fuel Services
347     None  Maryanna Fiorentino                      Xcel Energy
348  Midwest         Cliff Meints                            Xerox
349     None          Maren Musto                       Yum Brands
350     None          Dawna Agnew                             eBay

[351 rows x 3 columns]

In [57]:
# 2 Provide a table that provides the region for each sales_rep along with 
#   their associated accounts. Only for Midwest, sales rep name starts with S
#   sort accounts alphabetically.
sql_query('SELECT r.name region, sr.name rep, a.name account \
           FROM sales_reps sr \
           JOIN region r \
           ON sr.region_id = r.id \
           JOIN accounts a \
           ON sr.id = a.sales_rep_id \
           WHERE region LIKE "Midwest" AND rep LIKE "S%" \
           ORDER BY account;')

    region                    rep                   account
0  Midwest  Sherlene Wetherington  Community Health Systems
1  Midwest  Sherlene Wetherington               Progressive
2  Midwest  Sherlene Wetherington                  Rite Aid
3  Midwest  Sherlene Wetherington         Time Warner Cable
4  Midwest  Sherlene Wetherington              U.S. Bancorp

In [60]:
# 3 Provide a table that provides the region for each sales_rep along with 
#   their associated accounts. Only for Midwest, sales rep last name starts 
#   with K, sort accounts alphabetically.
sql_query('SELECT r.name region, sr.name rep, a.name account \
           FROM sales_reps sr \
           JOIN region r \
           ON sr.region_id = r.id \
           JOIN accounts a \
           ON sr.id = a.sales_rep_id \
           WHERE rep LIKE "% K%" AND region = "Midwest" \
           ORDER BY account;')

     region                rep                            account
0   Midwest       Delilah Krum                              Amgen
1   Midwest       Delilah Krum                         AutoNation
2   Midwest       Delilah Krum              Capital One Financial
3   Midwest       Delilah Krum                            Cummins
4   Midwest  Carletta Kosinski                            Danaher
5   Midwest  Carletta Kosinski                     Dollar General
6   Midwest       Delilah Krum  Hartford Financial Services Group
7   Midwest  Carletta Kosinski                International Paper
8   Midwest       Delilah Krum                     Kimberly-Clark
9   Midwest  Carletta Kosinski                         McDonald's
10  Midwest  Carletta Kosinski                   Northrop Grumman
11  Midwest       Delilah Krum                 Plains GP Holdings
12  Midwest       Delilah Krum                 Southwest Airlines

In [65]:
# 4 Provide the name for each region for every order, as well as the account 
#   name and the unit price they paid, only if standard quantity is more than 100
sql_query('SELECT r.name region, a.name account, \
                  o.total_amt_usd/(o.total + 0.01) unit_price \
           FROM region r \
           JOIN sales_reps sr \
           ON r.id = sr.region_id \
           JOIN accounts a \
           ON sr.id = a.sales_rep_id\
           JOIN orders o \
           ON a.id = o.account_id\
           WHERE o.standard_qty > 100;')

         region             account  unit_price
0     Northeast             Walmart    5.759600
1     Northeast             Walmart    5.965175
2     Northeast             Walmart    5.444236
3     Northeast             Walmart    5.960184
4     Northeast             Walmart    6.168719
5     Northeast             Walmart    6.628910
6     Northeast             Walmart    5.646522
7     Northeast             Walmart    6.033417
8     Northeast             Walmart    6.019492
9     Northeast             Walmart    6.109804
10    Northeast             Walmart    6.391138
11    Northeast         Exxon Mobil    5.054602
12    Northeast               Apple    5.096584
13    Northeast               Apple    5.263203
14    Northeast               Apple    5.120315
15    Northeast               Apple    5.176939
16    Northeast               Apple    5.064018
17    Northeast               Apple    5.093753
18    Northeast  Berkshire Hathaway    5.483687
19    Northeast            McKesson    5.713830
20    Northeast            McKesson    5.157017
21    Northeast            McKesson    5.700722
22    Northeast  UnitedHealth Group    5.346446
23    Northeast  UnitedHealth Group    5.203317
24    Northeast  UnitedHealth Group    4.996325
25    Northeast  UnitedHealth Group    5.388178
26    Northeast  UnitedHealth Group    5.078483
27    Northeast  UnitedHealth Group    5.001227
28    Northeast          CVS Health    5.543245
29    Northeast          CVS Health    5.215494
...         ...                 ...         ...
4479       West   Avis Budget Group    7.370153
4480       West   Avis Budget Group    7.533184
4481       West            Broadcom    7.243050
4482       West          Dean Foods    7.041920
4483       West   Eversource Energy    6.972121
4484       West   Eversource Energy    6.630421
4485       West   Eversource Energy    6.417304
4486       West   Eversource Energy    7.047631
4487       West   Eversource Energy    6.587460
4488       West  Franklin Resources    6.478865
4489       West  Franklin Resources    6.739521
4490       West  Franklin Resources    6.840021
4491       West  Franklin Resources    6.597204
4492       West  Franklin Resources    6.623685
4493       West  Franklin Resources    6.252451
4494       West  Franklin Resources    6.719622
4495       West  Franklin Resources    6.721529
4496       West  Franklin Resources    6.598181
4497       West  Franklin Resources    6.660996
4498       West  Franklin Resources    6.711829
4499       West  Franklin Resources    6.888501
4500       West  Franklin Resources    6.563520
4501       West               Masco    6.272513
4502       West       Lithia Motors    5.631625
4503       West       Lithia Motors    6.093901
4504       West                 KKR    7.467654
4505       West                 KKR    7.265387
4506       West                 KKR    7.082861
4507       West                 PPL    6.565007
4508       West                 PPL    7.066954

[4509 rows x 3 columns]

Note that to get this to function, the order needed to be the "farthest" table first (**region**) and moving through the connections until the "closest" (**order**).

In [66]:
# 5 Provide the name for each region for every order, as well as the account 
#   name and the unit price they paid, only if standard > 100 & poster > 50
sql_query('SELECT r.name region, a.name account, \
                  o.total_amt_usd/(o.total + 0.01) unit_price \
           FROM region r \
           JOIN sales_reps sr \
           ON r.id = sr.region_id \
           JOIN accounts a \
           ON sr.id = a.sales_rep_id \
           JOIN orders o \
           ON a.id = o.account_id \
           WHERE o.standard_qty > 100 AND o.poster_qty > 50 \
           ORDER BY unit_price;')

        region                           account  unit_price
0    Northeast         State Farm Insurance Cos.    5.119282
1    Southeast                      DISH Network    5.231816
2    Northeast                    Travelers Cos.    5.235181
3    Northeast                          Best Buy    5.260426
4         West            Stanley Black & Decker    5.266396
5    Northeast                         Citigroup    5.273081
6    Southeast                         BlackRock    5.278270
7    Southeast                             Nucor    5.289094
8    Northeast                             Merck    5.296391
9      Midwest                    Sears Holdings    5.300912
10   Southeast                         BlackRock    5.301770
11   Northeast                        Fannie Mae    5.303465
12     Midwest                             Aflac    5.305558
13   Northeast               Northwestern Mutual    5.307969
14   Northeast                              TIAA    5.310935
15   Northeast                     Cisco Systems    5.318950
16     Midwest                             Aflac    5.321528
17   Northeast                             FedEx    5.326170
18        West                 Core-Mark Holding    5.328663
19     Midwest                    Dollar General    5.333630
20        West  Thrivent Financial for Lutherans    5.337679
21   Northeast       Philip Morris International    5.339153
22   Northeast       Philip Morris International    5.340240
23   Southeast                      Land O'Lakes    5.340489
24        West                 Core-Mark Holding    5.343204
25        West   American Family Insurance Group    5.347421
26   Southeast                         Supervalu    5.347728
27   Southeast                               ADP    5.348600
28        West                 Reynolds American    5.348768
29     Midwest                        AutoNation    5.351093
..         ...                               ...         ...
805  Northeast                  General Dynamics    7.415869
806  Southeast                         Nordstrom    7.417501
807       West                            Mosaic    7.422585
808  Southeast                               CDW    7.423709
809    Midwest                           Centene    7.433695
810  Northeast               United Technologies    7.437769
811  Southeast                             Fluor    7.441618
812  Northeast                       Wells Fargo    7.447165
813    Midwest                             Aflac    7.459659
814  Northeast                       Freddie Mac    7.459844
815       West                               KKR    7.467654
816       West               Precision Castparts    7.497959
817  Northeast                       Wells Fargo    7.528751
818  Southeast              Edison International    7.530563
819       West                 Avis Budget Group    7.533184
820  Southeast                               CSX    7.560279
821  Northeast            Mondelez International    7.592776
822  Southeast               Illinois Tool Works    7.601834
823  Southeast                           Aramark    7.635793
824       West                 Avis Budget Group    7.740084
825       West                      Hormel Foods    7.747530
826    Midwest                             Amgen    7.753831
827  Northeast                            Costco    7.789352
828  Southeast      PNC Financial Services Group    7.895139
829    Midwest                            Paccar    7.986962
830       West       Fidelity National Financial    7.992802
831  Northeast                               CHS    8.018849
832       West                      Pacific Life    8.063023
833       West                            Mosaic    8.066329
834  Northeast                               IBM    8.089906

[835 rows x 3 columns]

In [67]:
# 6 As above but in descencing order of unit price
sql_query('SELECT r.name region, a.name account, \
                  o.total_amt_usd/(o.total + 0.01) unit_price \
           FROM region r \
           JOIN sales_reps sr \
           ON r.id = sr.region_id \
           JOIN accounts a \
           ON sr.id = a.sales_rep_id \
           JOIN orders o \
           ON a.id = o.account_id \
           WHERE o.standard_qty > 100 AND o.poster_qty > 50 \
           ORDER BY unit_price DESC;')

        region                           account  unit_price
0    Northeast                               IBM    8.089906
1         West                            Mosaic    8.066329
2         West                      Pacific Life    8.063023
3    Northeast                               CHS    8.018849
4         West       Fidelity National Financial    7.992802
5      Midwest                            Paccar    7.986962
6    Southeast      PNC Financial Services Group    7.895139
7    Northeast                            Costco    7.789352
8      Midwest                             Amgen    7.753831
9         West                      Hormel Foods    7.747530
10        West                 Avis Budget Group    7.740084
11   Southeast                           Aramark    7.635793
12   Southeast               Illinois Tool Works    7.601834
13   Northeast            Mondelez International    7.592776
14   Southeast                               CSX    7.560279
15        West                 Avis Budget Group    7.533184
16   Southeast              Edison International    7.530563
17   Northeast                       Wells Fargo    7.528751
18        West               Precision Castparts    7.497959
19        West                               KKR    7.467654
20   Northeast                       Freddie Mac    7.459844
21     Midwest                             Aflac    7.459659
22   Northeast                       Wells Fargo    7.447165
23   Southeast                             Fluor    7.441618
24   Northeast               United Technologies    7.437769
25     Midwest                           Centene    7.433695
26   Southeast                               CDW    7.423709
27        West                            Mosaic    7.422585
28   Southeast                         Nordstrom    7.417501
29   Northeast                  General Dynamics    7.415869
..         ...                               ...         ...
805    Midwest                        AutoNation    5.351093
806       West                 Reynolds American    5.348768
807  Southeast                               ADP    5.348600
808  Southeast                         Supervalu    5.347728
809       West   American Family Insurance Group    5.347421
810       West                 Core-Mark Holding    5.343204
811  Southeast                      Land O'Lakes    5.340489
812  Northeast       Philip Morris International    5.340240
813  Northeast       Philip Morris International    5.339153
814       West  Thrivent Financial for Lutherans    5.337679
815    Midwest                    Dollar General    5.333630
816       West                 Core-Mark Holding    5.328663
817  Northeast                             FedEx    5.326170
818    Midwest                             Aflac    5.321528
819  Northeast                     Cisco Systems    5.318950
820  Northeast                              TIAA    5.310935
821  Northeast               Northwestern Mutual    5.307969
822    Midwest                             Aflac    5.305558
823  Northeast                        Fannie Mae    5.303465
824  Southeast                         BlackRock    5.301770
825    Midwest                    Sears Holdings    5.300912
826  Northeast                             Merck    5.296391
827  Southeast                             Nucor    5.289094
828  Southeast                         BlackRock    5.278270
829  Northeast                         Citigroup    5.273081
830       West            Stanley Black & Decker    5.266396
831  Northeast                          Best Buy    5.260426
832  Northeast                    Travelers Cos.    5.235181
833  Southeast                      DISH Network    5.231816
834  Northeast         State Farm Insurance Cos.    5.119282

[835 rows x 3 columns]

## Aggregations
Sometimes we want to look at row-level data, but sometimes it's easier to be able to aggragate them to get a better picture. 

There's a number of functions that can be used to do this:
- **COUNT**: Counts the number of rows in a particular column
- **SUM**: Adds all the values in a column
- **MIN** and **MAX**: Return the lowest and highest (respectively) values in a column
- **AVG**: Calculates the mean of values in a column

These functions always operate down columns and not across rows. 

There is an additional datatype that is worth recognizing when looking at aggregations: **NULLs**. A **NULL** value represents data that is not entered, either intentionally or as a result of poor data collection. 

To find nulls we can use the following syntax:
```sql
SELECT *
FROM accounts
WHERE primary_poc IS NULL
```

Using **NOT** allows the inverse of this query.

### Count 
Count will provide a count of all rows that contain non-null data. We can count using:

```sql
SELECT COUNT(*) AS order_count
FROM orders
WHERE occurred_at BETWEEN '2016-12-01' AND '2017-01-01';
```

It sounds like if a row has any non-null data it will be counted, so usually this produces a count that is the same as the number of rows.

Let's test this out.

In [68]:
sql_query('SELECT * \
           FROM orders \
           WHERE occurred_at BETWEEN "2016-12-01" AND "2017-01-01";')

,id,account_id,occurred_at,standard_qty,gloss_qty,poster_qty,total,standard_amt_usd,gloss_amt_usd,poster_amt_usd,total_amt_usd
0,16,1001,2016-12-24T05:53:13.000Z,123,127,19,269,613.77,951.23,154.28,1719.28
1,17,1011,2016-12-21T10:59:34.000Z,527,14,0,541,2629.73,104.86,0.00,2734.59
2,24,1031,2016-12-25T03:54:27.000Z,1148,0,215,1363,5728.52,0.00,1745.80,7474.32
3,27,1041,2016-12-12T07:50:01.000Z,157,34,21,212,783.43,254.66,170.52,1208.61
4,33,1051,2016-12-30T08:45:43.000Z,495,1,1,497,2470.05,7.49,8.12,2485.66
5,36,1061,2016-12-16T21:32:36.000Z,290,22,18,330,1447.10,164.78,146.16,1758.04
6,37,1071,2016-12-13T09:01:03.000Z,803,31,19,853,4006.97,232.19,154.28,4393.44
7,59,1081,2016-12-23T13:19:56.000Z,293,29,0,322,1462.07,217.21,0.00,1679.28
8,87,1091,2016-12-14T21:26:59.000Z,153,0,13,166,763.47,0.00,105.56,869.03
9,117,1121,2016-12-07T18:48:16.000Z,321,38,9,368,1601.79,284.62,73.08,1959.49
10,125,1131,2016-12-07T06:28:31.000Z,303,28,0,331,1511.97,209.72,0.00,1721.69
11,129,1141,2016-12-21T15:52:58.000Z,143,1045,2157,3345,713.57,7827.05,17514.84,26055.46
12,130,1151,2016-12-30T05:02:46.000Z,503,0,56,559,2509.97,0.00,454.72,2964.69
13,141,1161,2016-12-25T20:33:25.000Z,509,7,6,522,2539.91,52.43,48.72,2641.06
14,146,1171,2016-12-20T18:09:01.000Z,257,34,63,354,1282.43,254.66,511.56,2048.65
15,184,1181,2016-12-17T22:14:14.000Z,428,0,22,450,2135.72,0.00,178.64,2314.36
16,196,1191,2016-12-15T20:49:47.000Z,0,171,24,195,0.00,1280.79,194.88,1475.67
17,198,1201,2016-12-11T05:51:52.000Z,510,0,11,521,2544.90,0.00,89.32,2634.22
18,200,1211,2016-12-21T23:39:04.000Z,311,22,10,343,1551.89,164.78,81.20,1797.87
19,225,1221,2016-12-24T21:14:21.000Z,510,9,39,558,2544.90,67.41,316.68,2928.99
20,235,1231,2016-12-20T14:07:59.000Z,502,0,0,502,2504.98,0.00,0.00,2504.98
21,242,1241,2016-12-06T15:03:16.000Z,136,0,34,170,678.64,0.00,276.08,954.72
22,284,1261,2016-12-15T05:00:47.000Z,286,71,32,389,1427.14,531.79,259.84,2218.77
23,324,1281,2016-12-08T10:14:58.000Z,512,0,26,538,2554.88,0.00,211.12,2766.00
24,345,1291,2016-12-15T09:24:19.000Z,284,25,64,373,1417.16,187.25,519.68,2124.09
25,382,1301,2016-12-29T01:40:19.000Z,89,26,32,147,444.11,194.74,259.84,898.69
26,388,1311,2016-12-02T22:47:08.000Z,294,34,36,364,1467.06,254.66,292.32,2014.04
27,402,1321,2016-12-03T13:23:52.000Z,502,0,0,502,2504.98,0.00,0.00,2504.98
28,408,1331,2016-12-13T20:59:34.000Z,103,30,30,163,513.97,224.70,243.60,982.27
29,413,1341,2016-12-23T18:13:01.000Z,287,22,0,309,1432.13,164.78,0.00,1596.91
...,...,...,...,...,...,...,...,...,...,...,...
433,6495,3941,2016-12-10T06:49:41.000Z,40,219,67,326,199.60,1640.31,544.04,2383.95
434,6497,3951,2016-12-19T14:16:09.000Z,430,606,305,1341,2145.70,4538.94,2476.60,9161.24
435,6499,3961,2016-12-15T00:13:59.000Z,104,41,35,180,518.96,307.09,284.20,1110.25
436,6502,3971,2016-12-01T00:34:14.000Z,503,588,202,1293,2509.97,4404.12,1640.24,8554.33
437,6503,3971,2016-12-31T15:54:47.000Z,489,589,194,1272,2440.11,4411.61,1575.28,8427.00
438,6518,3981,2016-12-21T08:55:12.000Z,24,46,56,126,119.76,344.54,454.72,919.02
439,6529,3991,2016-12-17T01:01:35.000Z,0,13,257,270,0.00,97.37,2086.84,2184.21
440,6535,4021,2016-12-19T23:23:01.000Z,518,589,181,1288,2584.82,4411.61,1469.72,8466.15
441,6570,4061,2016-12-28T23:43:44.000Z,6,47,31,84,29.94,352.03,251.72,633.69
442,6572,4081,2016-12-23T21:38:04.000Z,0,505,306,811,0.00,3782.45,2484.72,6267.17
443,6598,4131,2016-12-12T16:34:28.000Z,638,590,194,1422,3183.62,4419.10,1575.28,9178.00
444,6631,4151,2016-12-18T18:23:39.000Z,270,442,188,900,1347.30,3310.58,1526.56,6184.44
445,6649,4161,2016-12-19T07:38:07.000Z,134,0,34,168,668.66,0.00,276.08,944.74
446,6658,4171,2016-12-22T15:02:23.000Z,76,60,37,173,379.24,449.40,300.44,1129.08
447,6707,4221,2016-12-02T08:49:06.000Z,0,112,105,217,0.00,838.88,852.60,1691.48
448,6723,4251,2016-12-26T08:39:56.000Z,0,31,21,52,0.00,232.19,170.52,402.71
449,6727,4261,2016-12-02T12:54:26.000Z,5,479,385,869,24.95,3587.71,3126.20,6738.86
450,6744,4271,2016-12-20T20:45:16.000Z,0,451,292,743,0.00,3377.99,2371.04,5749.03
451,6754,4281,2016-12-21T09:05:26.000Z,24,481,287,792,119.76,3602.69,2330.44,6052.89
452,6779,4291,2016-12-26T18:58:12.000Z,15,501,314,830,74.85,3752.49,2549.68,6377.02
453,6787,4301,2016-12-16T12:31:55.000Z,0,502,284,786,0.00,3759.98,2306.08,6066.06
454,6806,4331,2016-12-02T04:35:16.000Z,0,79,57,136,0.00,591.71,462.84,1054.55
455,6823,4361,2016-12-24T13:40:54.000Z,79,450,322,851,394.21,3370.50,2614.64,6379.35
456,6830,4391,2016-12-22T11:21:08.000Z,62,56,0,118,309.38,419.44,0.00,728.82
457,6836,4421,2016-12-21T09:13:38.000Z,503,600,171,1274,2509.97,4494.00,1388.52,8392.49
458,6849,4431,2016-12-01T13:36:38.000Z,503,599,152,1254,2509.97,4486.51,1234.24,8230.72
459,6853,4441,2016-12-20T15:20:48.000Z,70,53,112,235,349.30,396.97,909.44,1655.71
460,6892,4461,2016-12-23T17:36:00.000Z,54,453,286,793,269.46,3392.97,2322.32,5984.75
461,6893,4471,2016-12-05T05:10:54.000Z,0,42,31,73,0.00,314.58,251.72,566.30
462,6912,4501,2016-12-21T13:30:42.000Z,61,150,52,263,304.39,1123.50,422.24,1850.13

We get a result that has 463 rows.

In [69]:
sql_query('SELECT COUNT(*) AS order_count \
           FROM orders \
           WHERE occurred_at BETWEEN "2016-12-01" AND "2017-01-01";')

   order_count
0          463

Yes, these match!

While the count of a column will match this if all rows are filled, if there are null values, then the count will be different. For example, with the **primary_poc** column.

In [71]:
sql_query('SELECT COUNT(primary_poc) AS account_primary_poc_count \
           FROM accounts;')

   account_primary_poc_count
0                        351

In [72]:
sql_query('SELECT COUNT(*) AS account_count \
           FROM accounts;')

   account_count
0            351

In [81]:
sql_query('SELECT * \
           FROM accounts \
           WHERE primary_poc IS NULL;')

Empty DataFrame
Columns: [id, name, website, lat, long, primary_poc, sales_rep_id]
Index: []

It looks like the data set that I am working with doesn't have this null value, I'm not sure why.

### Sum
**SUM** works similarly to **COUNT** but you'll want to specify column names rather than using **\***.

In [83]:
sql_query('SELECT SUM(standard_qty) AS standard, \
                  SUM(gloss_qty) AS gloss, \
                  SUM(poster_qty) AS poster \
           FROM orders;')

   standard    gloss  poster
0   1938346  1013773  723646

**Quiz Questions**
1. Find the total amount of **poster_qty** paper ordered in the **orders** table.
2. Find the total amount of **standard_qty** paper ordered in the **orders** table.
3. Find the total dollar amount of sales using the **total_amt_usd** in the **orders** table.
4. Find the total amount spent on **standard_amt_usd** and **gloss_amt_usd** paper for each order in the orders table. This should give a dollar amount for each order in the table.
5. Find the **standard_amt_usd** per unit of **standard_qty paper**. Your solution should use both an aggregation and a mathematical operator.

In [94]:
# 1 Total amount of poster_qty paper ordered
sql_query('SELECT SUM(poster_qty) poster_units \
           FROM orders;')

   poster_units
0        723646

In [93]:
# 2 Total amount of standard_qty paper ordered
sql_query('SELECT SUM(standard_qty) standard_units \
           FROM orders;')

   standard_units
0         1938346

In [87]:
# 3 Total dollar amount of sales
sql_query('SELECT SUM(total_amt_usd) total_sales \
           FROM orders;')

   total_sales
0  23141511.83

In [95]:
# 4 Total amount spent on standard_amt_usd and gloss_amt_usd paper for each order
sql_query('SELECT standard_amt_usd + gloss_amt_usd AS total_standard_gloss \
           FROM orders;')

      total_standard_gloss
0                   778.55
1                  1255.19
2                   776.18
3                   958.24
4                   756.13
5                   693.73
6                   751.16
7                   826.08
8                   573.93
9                   813.60
10                  773.63
11                  865.93
12                  593.86
13                 1555.10
14                  925.84
15                 1565.00
16                 2734.59
17                 2747.11
18                 2936.92
19                 2410.17
20                 2669.65
21                 2534.94
22                 2911.76
23                 5728.52
24                 1696.74
25                 1696.71
26                 1038.09
27                 3149.11
28                 2747.17
29                 2425.14
...                    ...
6882               4086.81
6883               4031.92
6884               4611.17
6885               3872.17
6886               2633.94
6887               3884.64
6888               3907.20
6889               4239.20
6890               4106.85
6891               3662.43
6892                314.58
6893                896.20
6894                823.90
6895               4109.37
6896               3834.88
6897               4041.99
6898               6656.78
6899               3969.59
6900               3872.29
6901               4014.56
6902               4760.97
6903               4051.91
6904               3829.16
6905               4920.75
6906               3737.51
6907               1545.40
6908                706.54
6909                783.90
6910                816.20
6911               1427.89

[6912 rows x 1 columns]

Note that is is how we aggregate across rows.

In [90]:
# 5 Standard_amt_usd per unit of standard_qty paper
sql_query('SELECT SUM(standard_amt_usd)/SUM(standard_qty) standard_unit_price \
           FROM orders;')

   standard_unit_price
0                 4.99

### Min, Max and Average
These have a similar syntax to **SUM** and **COUNT**. It is worth noting that **AVG** ingores null values. This means that if you wanted to calculate the mean including null values, you would have to do sum and then count. 

1. When was the earliest order ever placed? You only need to return the date.
2. Try performing the same query as in question 1 without using an aggregation function. 
3. When did the most recent (latest) **web_event** occur?
4. Try to perform the result of the previous query without using an aggregation function.
5. Find the mean amount spent per order on each paper type, as well as the mean amount of each paper type purchased per order. Your final answer should have 6 values - one for each paper type for the average number of sales, as well as the average amount.
6. What is the MEDIAN total_usd spent on all orders?

In [96]:
# 1 When was the earliest order ever placed?
sql_query('SELECT MIN(occurred_at) first_order \
           FROM orders;')

                first_order
0  2013-12-04T04:22:44.000Z

In [97]:
# 2 As above without aggregation
sql_query('SELECT occurred_at AS first_order \
           FROM orders \
           ORDER BY occurred_at \
           LIMIT 1;')

                first_order
0  2013-12-04T04:22:44.000Z

In [98]:
# 3 When did the most recent (latest) web_event occur?
sql_query('SELECT MAX(occurred_at) most_recent_web_event \
           FROM web_events;')

      most_recent_web_event
0  2017-01-01T23:51:09.000Z

In [99]:
# 4 As above without aggregation
sql_query('SELECT occurred_at AS most_recent_web_event \
           FROM web_events \
           ORDER BY occurred_at DESC \
           LIMIT 1;')

      most_recent_web_event
0  2017-01-01T23:51:09.000Z

In [102]:
# 5 Mean amount spent per order on each paper type, as well as the mean amount
#   of each paper type purchased per order
sql_query('SELECT AVG(standard_amt_usd) mean_standard_sales_amt, \
                  AVG(standard_qty) mean_standard_order_units, \
                  AVG(gloss_amt_usd) mean_gloss_sales_amt, \
                  AVG(gloss_qty) mean_gloss_order_units, \
                  AVG(poster_amt_usd) mean_poster_sales_amt, \
                  AVG(poster_qty) mean_poster_order_units \
           FROM orders;')

,mean_standard_sales_amt,mean_standard_order_units,mean_gloss_sales_amt,mean_gloss_order_units,mean_poster_sales_amt,mean_poster_order_units
0,1399.355692,280.432002,1098.54742,146.668547,850.116539,104.694155

In [104]:
# 6 Find median
# To find the median need the highest value at the middle of the count. 
# Need to see if row_count is even
sql_query('SELECT COUNT(total_amt_usd) order_count \
           FROM orders;')

   order_count
0         6912

It is!

In [107]:
# Let's see if we can do this in one go
sql_query('SELECT MAX(total_amt_usd) median_total_sale \
           FROM orders \
           ORDER BY total_amt_usd \
           LIMIT 3456;') # Seems can't reference column count with limit

   median_total_sale
0          232207.07

Hmm, seems this doesn't work - it takes the max before it completes the limit.

I made a mistake - because it's even, I need the average of the middle two values. 

Here's what I actually need to do.

In [108]:
sql_query('SELECT * \
           FROM (SELECT total_amt_usd \
                 FROM orders \
                 ORDER BY total_amt_usd \
                 LIMIT 3457) AS Table1 \
            ORDER By total_amt_usd DESC \
            LIMIT 2;')

   total_amt_usd
0        2483.16
1        2482.55

Let's talk about what this does - this allows us to use a sub-query. So, the original query get's what we need with a limit of 3457. From this we select everything (because we've already limited it in the other query) and then sort descending and select the top two. 

Hmm, can you not sub-query and average this?

In [113]:
sql_query('SELECT AVG(total_amt_usd) median_total_sale \
           FROM (SELECT * \
                 FROM (SELECT total_amt_usd \
                       FROM orders \
                       ORDER BY total_amt_usd \
                       LIMIT 3457) AS Table1 \ 
                  ORDER By total_amt_usd DESC \
                  LIMIT 2) AS Table2;') 
# AS Table2 is not required but helpful if referencing that query elsewhere

   median_total_sale
0           2482.855

This is a sub-optimal method because it relies on the hard-coding of the limit. As soon as the number of rows in the table changes, this needs to be recalculated.

### Group By
**GROUP BY** allows us to aggregate one column by the values in another column. 

**GROUP BY** always goes between the **WHERE** clause (when applicable) and the **ORDER BY** clause. 

Together, it looks like:
```sql
SELECT account_id, 
       SUM(standard_qty) standard_sum, 
       SUM(gloss_qty) gloss_sum,
       SUM(poster_qty) poster_sum
FROM orders
GROUP BY account_id
ORDER BY account_id
```
Whenever a field is in the **SELECT** column but not aggregated (when aggregations are present) SQL expects it to be in the **GROUP BY** statement.

1. Which **account** (by name) placed the earliest order? Your solution should have the **account name** and the **date** of the order.
2. Find the **total sales in usd** for each account. You should include two columns - the **total sales** for each company's orders in usd and the **company name**.
3. Via what channel did the most recent (latest) **web_event** occur, which **account** was associated with this web_event? Your query should return only three values - the date, channel, and account name.
4. Find the total number of times each type of **channel** from the **web_events** was used. Your final table should have two columns - the **channel** and the number of times the channel was used.
5. Who was the **primary contact** associated with the earliest **web_event**? 
6. What was the smallest order placed by each **account** in terms of **total usd**? Provide only two columns - the **account name** and the **total usd**. Order from smallest dollar amounts to largest.
7. Find the number of **sales reps** in each region. Your final table should have two columns - the **region** and the number of **sales_reps**. Order from fewest reps to most reps.

In [114]:
# 1 Which account (by name) placed the earliest order?
sql_query('SELECT a.name account, o.occurred_at date \
           FROM accounts a \
           JOIN orders o \
           ON a.id = o.account_id \
           ORDER BY date \
           LIMIT 1;')

        account                      date
0  DISH Network  2013-12-04T04:22:44.000Z

In [117]:
# 2 Find the total sales in usd for each account.
sql_query('SELECT a.name account, \
                  SUM(o.total_amt_usd) total_sales \
           FROM accounts a \
           JOIN orders o \
           ON a.id = o.account_id \
           GROUP BY account;')

                             account  total_sales
0                                 3M    127945.10
1                                ADP    163579.18
2                              AECOM     18491.51
3                                AES     13038.64
4                                AIG      9980.93
5                               AT&T     51647.76
6                             AbbVie     11243.63
7                Abbott Laboratories     96819.92
8                 Advance Auto Parts      6962.07
9                              Aetna    237781.30
10                             Aflac    117862.77
11          Air Products & Chemicals     11814.55
12                             Alcoa     19882.16
13                          Allstate     96779.18
14                    Ally Financial     37653.96
15                          Alphabet     44407.22
16                      Altria Group    116165.15
17                        Amazon.com     28678.06
18           American Airlines Group     30083.18
19           American Electric Power     32044.55
20                  American Express     45557.51
21   American Family Insurance Group    153015.87
22              Ameriprise Financial     55883.55
23                 AmerisourceBergen     38741.81
24                             Amgen     82013.05
25                Anadarko Petroleum     80328.56
26                            Anthem     47487.78
27                             Apple     20767.15
28                 Applied Materials      3093.95
29                           Aramark     21692.01
..                               ...          ...
320             United Natural Foods     54443.06
321              United States Steel    244695.99
322              United Technologies    235051.07
323               UnitedHealth Group     21937.08
324                           Univar     16626.60
325        Universal Health Services      5269.51
326                       Unum Group     22734.13
327                               VF     18251.39
328                    Valero Energy     52020.60
329                          Veritiv      5735.41
330                          Verizon    115376.17
331                           Viacom     33673.86
332                             Visa     61255.50
333                   Voya Financial     15782.23
334                    W.W. Grainger      8384.61
335         Walgreens Boots Alliance    130153.59
336                          Walmart    124014.87
337                 Waste Management     10067.87
338            WellCare Health Plans      9743.13
339                      Wells Fargo    200174.66
340                         WestRock     13282.42
341                  Western Digital    269155.34
342                 Western Refining    108579.84
343                        Whirlpool     32965.13
344               Whole Foods Market     20240.66
345              World Fuel Services     10833.11
346                      Xcel Energy     19975.91
347                            Xerox      8759.93
348                       Yum Brands     28296.53
349                             eBay     94244.44

[350 rows x 2 columns]

In [121]:
# 3 Via what channel did the most recent (latest) web_event occur, 
#   which account was associated with this web_event?
sql_query('SELECT w.occurred_at date, w.channel, a.name account \
           FROM web_events w\
           JOIN accounts a \
           ON w.account_id = a.id \
           ORDER BY date DESC \
           LIMIT 1;')

                       date  channel            account
0  2017-01-01T23:51:09.000Z  organic  Molina Healthcare

In [122]:
# 4 Find the total number of times each type of channel from the 
#   web_events was used.
sql_query('SELECT channel, \
                  COUNT(channel) count \
           FROM web_events \
           GROUP BY channel;')

    channel  count
0   adwords    906
1    banner    476
2    direct   5298
3  facebook    967
4   organic    952
5   twitter    474

In [123]:
# 5 Who was the primary contact associated with the earliest web_event?
sql_query('SELECT a.primary_poc\
           FROM web_events w \
           JOIN accounts a \
           ON w.account_id = a.id \
           ORDER BY w.occurred_at \
           LIMIT 1;')

    primary_poc
0  Leana Hawker

In [124]:
# 6 What was the smallest order placed by each account in terms of total usd?
#   Order by smallest dollar amount first
sql_query('SELECT a.name account, \
                  MIN(o.total_amt_usd) smallest_order \
           FROM accounts a \
           JOIN orders o \
           ON a.id = o.account_id \
           GROUP BY account \
           ORDER BY smallest_order;')

                           account  smallest_order
0                        BlackRock            0.00
1                           Boeing            0.00
2                          Chevron            0.00
3                        Citigroup            0.00
4                           Disney            0.00
5                            FedEx            0.00
6                    General Mills            0.00
7                  Gilead Sciences            0.00
8                J.P. Morgan Chase            0.00
9                     Land O'Lakes            0.00
10                   Lithia Motors            0.00
11              Marathon Petroleum            0.00
12                        Monsanto            0.00
13          Navistar International            0.00
14           R.R. Donnelley & Sons            0.00
15               Reynolds American            0.00
16          Stanley Black & Decker            0.00
17        Twenty-First Century Fox            0.00
18     United Continental Holdings            0.00
19                            eBay            0.00
20         American Electric Power           16.24
21                          DuPont           29.94
22                           Masco           29.96
23                  Kimberly-Clark           40.60
24                           Nucor           44.91
25                             Gap           56.84
26                             TJX           67.41
27                           Xerox           74.85
28            Edison International           78.68
29                      Yum Brands           81.20
..                             ...             ...
320                     BorgWarner         1776.21
321                    Toys 'R' Us         1777.29
322                     Amazon.com         1780.62
323                   Henry Schein         1810.40
324               Freeport-McMoRan         1811.58
325   Enterprise Products Partners         1834.20
326                        Stryker         1854.57
327                     CBRE Group         1922.16
328                  W.W. Grainger         1932.85
329                        Danaher         1936.39
330                  Campbell Soup         1962.96
331                           Ball         1982.74
332           Publix Super Markets         1995.80
333              AmerisourceBergen         2048.60
334                      Starbucks         2076.41
335                Priceline Group         2129.24
336  Bank of New York Mellon Corp.         2155.98
337                            AES         2277.74
338                   INTL FCStone         2372.11
339      Universal Health Services         2425.14
340                Lockheed Martin         2440.31
341                        MetLife         2525.00
342                          Loews         2566.22
343                         Lennar         2670.97
344                    Exxon Mobil         2734.59
345              Mohawk Industries         3025.65
346               Waste Management         3101.51
347                 General Motors         4393.44
348             Berkshire Hathaway         7474.32
349                            CBS         8648.07

[350 rows x 2 columns]

In [125]:
# 7 Find the number of sales reps in each region. Order by fewest to most reps
sql_query('SELECT r.name region, \
                  COUNT(sr.id) rep_count \
           FROM region r \
           JOIN sales_reps sr \
           ON r.id = sr.region_id \
           GROUP BY region \
           ORDER BY rep_count;')

      region  rep_count
0    Midwest          9
1  Southeast         10
2       West         10
3  Northeast         21

**GROUP BY** can also be ued with multiple columns.
1. For each account, determine the average amount of each type of paper they purchased across their orders. Your result should have four columns - one for the account name and one for the average quantity purchased for each of the paper types for each account. 
2. For each account, determine the average amount spent per order on each paper type. Your result should have four columns - one for the account name and one for the average amount spent on each paper type.
3. Determine the number of times a particular channel was used in the web_events table for each sales rep. Your final table should have three columns - the name of the sales rep, the channel, and the number of occurrences. Order your table with the highest number of occurrences first.
4. Determine the number of times a particular channel was used in the web_events table for each region. Your final table should have three columns - the region name, the channel, and the number of occurrences. Order your table with the highest number of occurrences first.

In [126]:
# 1 Determine the average amount of each type of paper they purchased across 
#   their orders. Your answer should have four columns.
sql_query('SELECT a.name account, \
                  AVG(o.standard_qty) mean_standard, \
                  AVG(o.gloss_qty) mean_gloss, \
                  AVG(o.poster_qty) mean_poster \
           FROM accounts a \
           JOIN orders o \
           ON a.id = o.account_id \
           GROUP BY account;')

                             account  mean_standard  mean_gloss  mean_poster
0                                 3M     313.392857  279.750000   112.107143
1                                ADP     354.633333   60.533333    61.983333
2                              AECOM     363.777778   13.888889    16.666667
3                                AES     254.666667  304.000000    98.333333
4                                AIG     300.500000  349.000000   108.000000
5                               AT&T     107.046512   42.302326    43.116279
6                             AbbVie     238.333333  278.000000    58.666667
7                Abbott Laboratories     201.100000  196.700000    92.433333
8                 Advance Auto Parts     274.000000   19.750000    27.750000
9                              Aetna     229.196078  211.745098   238.019608
10                             Aflac     450.162162   30.837838    87.216216
11          Air Products & Chemicals     206.750000  171.500000    78.500000
12                             Alcoa     311.454545   10.363636    21.636364
13                          Allstate     269.040000  215.360000   112.760000
14                    Ally Financial     303.500000  299.500000   116.875000
15                          Alphabet     317.400000  249.600000   121.600000
16                      Altria Group     381.098039   22.490196    25.568627
17                        Amazon.com     195.375000  196.125000   140.500000
18           American Airlines Group     369.636364   23.272727    88.181818
19           American Electric Power     295.705882   23.411765    28.823529
20                  American Express     308.086957   43.173913    14.782609
21   American Family Insurance Group     376.280702   30.789474    70.964912
22              Ameriprise Financial     383.458333   25.416667    27.666667
23                 AmerisourceBergen     178.000000  262.250000   841.500000
24                             Amgen     234.150000  251.800000   128.850000
25                Anadarko Petroleum     182.960000  183.120000   114.360000
26                            Anthem     362.809524   34.904762    23.333333
27                             Apple     315.200000   48.300000    17.500000
28                 Applied Materials      74.000000  115.500000    38.500000
29                           Aramark     120.250000  126.875000   143.000000
..                               ...            ...         ...          ...
320             United Natural Foods     301.280000   55.600000    31.760000
321              United States Steel     212.907692  224.769231   125.446154
322              United Technologies     220.344828  242.120690   140.344828
323               UnitedHealth Group     400.888889   39.555556    17.333333
324                           Univar     277.222222   18.111111    40.444444
325        Universal Health Services     517.500000    7.000000     0.000000
326                       Unum Group     340.000000   78.333333    29.888889
327                               VF     316.000000  283.750000   106.000000
328                    Valero Energy     151.153846  267.769231   152.923077
329                          Veritiv      89.200000   40.600000    49.000000
330                          Verizon     277.925926  220.333333   152.222222
331                           Viacom     404.785714   31.785714    18.142857
332                             Visa     237.200000  250.666667   125.933333
333                   Voya Financial     377.714286   26.142857    21.428571
334                    W.W. Grainger     166.500000  271.000000   164.000000
335         Walgreens Boots Alliance     401.800000   25.490909    21.000000
336                          Walmart     282.000000  279.678571   114.178571
337                 Waste Management     570.000000  281.500000    10.000000
338            WellCare Health Plans     316.000000  312.500000   117.500000
339                      Wells Fargo     183.857143  256.795918   153.244898
340                         WestRock      97.636364   43.636364    48.454545
341                  Western Digital     192.784615  239.830769   170.261538
342                 Western Refining     345.150000   99.350000    30.550000
343                        Whirlpool     272.866667   46.000000    60.533333
344               Whole Foods Market     392.111111   24.333333    13.555556
345              World Fuel Services     208.000000  206.750000    15.000000
346                      Xcel Energy     417.166667  157.000000     8.833333
347                            Xerox     266.750000   19.000000    88.250000
348                       Yum Brands     280.733333   38.666667    24.133333
349                             eBay     361.714286   32.228571    79.600000

[350 rows x 4 columns]

In [127]:
# 2 Determine the average amount spent per order on each paper type. 
#   Your result should have four columns.
sql_query('SELECT a.name account, \
                  AVG(o.standard_amt_usd) mean_std_sales, \
                  AVG(o.gloss_amt_usd) mean_gloss_sales, \
                  AVG(o.poster_amt_usd) mean_post_sales \
           FROM accounts a \
           JOIN orders o \
           ON a.id = o.account_id \
           GROUP BY account;')

,account,mean_std_sales,mean_gloss_sales,mean_post_sales
0,3M,1563.830357,2095.327500,910.310000
1,ADP,1769.620333,453.394667,503.304667
2,AECOM,1815.251111,104.027778,135.333333
3,AES,1270.786667,2276.960000,798.466667
4,AIG,1499.495000,2614.010000,876.960000
5,AT&T,534.162093,316.844419,350.104186
6,AbbVie,1189.283333,2082.220000,476.373333
7,Abbott Laboratories,1003.489000,1473.283000,750.558667
8,Advance Auto Parts,1367.260000,147.927500,225.330000
9,Aetna,1143.688431,1585.970784,1932.719216
10,Aflac,2246.309189,230.975405,708.195676
11,Air Products & Chemicals,1031.682500,1284.535000,637.420000
12,Alcoa,1554.158182,77.623636,175.687273
13,Allstate,1342.509600,1613.046400,915.611200
14,Ally Financial,1514.465000,2243.255000,949.025000
15,Alphabet,1583.826000,1869.504000,987.392000
16,Altria Group,1901.679216,168.451569,207.617255
17,Amazon.com,974.921250,1468.976250,1140.860000
18,American Airlines Group,1844.485455,174.312727,716.036364
19,American Electric Power,1475.572353,175.354118,234.047059
20,American Express,1537.353913,323.372609,120.034783
21,American Family Insurance Group,1877.640702,230.613158,576.235088
22,Ameriprise Financial,1913.457083,190.370833,224.653333
23,AmerisourceBergen,888.220000,1964.252500,6832.980000
24,Amgen,1168.408500,1885.982000,1046.262000
25,Anadarko Petroleum,912.970400,1371.568800,928.603200
26,Anthem,1810.419524,261.436667,189.466667
27,Apple,1572.848000,361.767000,142.100000
28,Applied Materials,369.260000,865.095000,312.620000
29,Aramark,600.047500,950.293750,1161.160000
...,...,...,...,...
320,United Natural Foods,1503.387200,416.444000,257.891200
321,United States Steel,1062.409385,1683.521538,1018.622769
322,United Technologies,1099.520690,1813.483966,1139.600000
323,UnitedHealth Group,2000.435556,296.271111,140.746667
324,Univar,1383.338889,135.652222,328.408889
325,Universal Health Services,2582.325000,52.430000,0.000000
326,Unum Group,1696.600000,586.716667,242.697778
327,VF,1576.840000,2125.287500,860.720000
328,Valero Energy,754.257692,2005.591538,1241.735385
329,Veritiv,445.108000,304.094000,397.880000
330,Verizon,1386.850370,1650.296667,1236.044444
331,Viacom,2019.880714,238.075000,147.320000
332,Visa,1183.628000,1877.493333,1022.578667
333,Voya Financial,1884.794286,195.810000,174.000000
334,W.W. Grainger,830.835000,2029.790000,1331.680000
335,Walgreens Boots Alliance,2004.982000,190.926909,170.520000
336,Walmart,1407.180000,2094.792500,927.130000
337,Waste Management,2844.300000,2108.435000,81.200000
338,WellCare Health Plans,1576.840000,2340.625000,954.100000
339,Wells Fargo,917.447143,1923.401429,1244.348571
340,WestRock,487.205455,326.836364,393.450909
341,Western Digital,961.995231,1796.332462,1382.523692
342,Western Refining,1722.298500,744.131500,248.066000
343,Whirlpool,1361.604667,344.540000,491.530667
344,Whole Foods Market,1956.634444,182.256667,110.071111
345,World Fuel Services,1037.920000,1548.557500,121.800000
346,Xcel Energy,2081.661667,1175.930000,71.726667
347,Xerox,1331.082500,142.310000,716.590000
348,Yum Brands,1400.859333,289.613333,195.962667
349,eBay,1804.954286,241.392000,646.352000

In [130]:
# 3 Determine the number of times a particular channel was used in the 
#   web_events table for each sales rep. Order by highest occurrences
sql_query('SELECT sr.name rep, \
                  w.channel, \
                  COUNT(w.channel) count \
           FROM sales_reps sr \
           JOIN accounts a \
           ON sr.id = a.sales_rep_id \
           JOIN web_events w \
           ON a.id = w.account_id \
           GROUP BY rep, w.channel \
           ORDER BY count DESC;')

                     rep   channel  count
0      Earlie Schleusner    direct    234
1          Vernita Plump    direct    232
2            Moon Torian    direct    194
3    Georgianna Chisholm    direct    188
4              Tia Amato    direct    185
5            Maren Musto    direct    184
6            Nelle Meaux    direct    179
7    Maryanna Fiorentino    direct    168
8        Dorotha Seawell    direct    161
9        Charles Bidwell    direct    159
10          Sibyl Lauria    direct    147
11         Elna Condello    direct    146
12        Micha Woodford    direct    145
13       Michel Averette    direct    145
14          Delilah Krum    direct    144
15          Elwood Shutt    direct    141
16       Arica Stoltzfus    direct    140
17         Gianna Dossey    direct    140
18        Calvin Ollison    direct    139
19          Hilma Busick    direct    137
20          Brandie Riva    direct    132
21          Cliff Meints    direct    122
22        Necole Victory    direct    109
23         Julia Behrman    direct    102
24         Samuel Racine    direct     99
25           Dawna Agnew    direct     91
26             Saran Ram    direct     86
27          Eugena Esser    direct     85
28        Debroah Wardle    direct     83
29       Derrick Boggess    direct     80
..                   ...       ...    ...
265          Chau Rowles   adwords      3
266          Chau Rowles   organic      3
267       Cordell Rieder    banner      3
268      Derrick Boggess    banner      3
269          Elba Felder    banner      3
270    Ernestine Pickron   twitter      3
271          Julie Starr   adwords      3
272          Julie Starr  facebook      3
273          Retha Sears   twitter      3
274      Akilah Drinkard   twitter      2
275       Babette Soukup   organic      2
276       Cordell Rieder   twitter      2
277          Julie Starr   organic      2
278     Kathleen Lalonde   adwords      2
279     Kathleen Lalonde   twitter      2
280         Nakesha Renn    banner      2
281          Retha Sears    banner      2
282        Samuel Racine   twitter      2
283       Shawanda Selke   adwords      2
284       Silvana Virden   adwords      2
285       Silvana Virden    banner      2
286       Silvana Virden   twitter      2
287          Cara Clarke   twitter      1
288     Kathleen Lalonde    banner      1
289         Nakesha Renn  facebook      1
290         Nakesha Renn   organic      1
291         Nakesha Renn   twitter      1
292       Shawanda Selke    banner      1
293       Shawanda Selke  facebook      1
294       Shawanda Selke   organic      1

[295 rows x 3 columns]

In [132]:
# 4 Determine the number of times a particular channel was used in the 
#   web_events table for each region. Order by highest occurrences.
sql_query('SELECT r.name region, \
                  w.channel, \
                  COUNT(w.channel) count \
           FROM region r \
           JOIN sales_reps sr \
           ON r.id = sr.region_id \
           JOIN accounts a \
           ON sr.id = a.sales_rep_id \
           JOIN web_events w \
           ON a.id = w.account_id \
           GROUP BY region, w.channel \
           ORDER BY count DESC;')

       region   channel  count
0   Northeast    direct   1800
1   Southeast    direct   1548
2        West    direct   1254
3     Midwest    direct    696
4   Northeast  facebook    335
5   Northeast   organic    317
6   Northeast   adwords    300
7   Southeast  facebook    278
8   Southeast   organic    275
9   Southeast   adwords    264
10       West   organic    243
11       West   adwords    241
12       West  facebook    229
13  Northeast    banner    155
14  Northeast   twitter    154
15  Southeast    banner    146
16  Southeast   twitter    127
17    Midwest  facebook    125
18       West   twitter    122
19    Midwest   organic    117
20       West    banner    116
21    Midwest   adwords    101
22    Midwest   twitter     71
23    Midwest    banner     59

### Distinct
**DISTINCT** lists unique occurrences of an event. It can function similarly to **GROUP BY**. (Seems to do similarly to `unique` in pandas)
1. Use DISTINCT to test if there are any accounts associated with more than one region.
2. Have any sales reps worked on more than one account?

In [140]:
# 1 Are any accounts associated with more than one region?
sql_query('SELECT a.id, \
                  r.name region \
            FROM region r \
            JOIN sales_reps s \
            ON r.id = s.region_id \
            JOIN accounts a \
            ON s.id = a.sales_rep_id \
            ORDER BY a.id;')

       id     region
0    1001  Northeast
1    1011  Northeast
2    1021  Northeast
3    1031  Northeast
4    1041  Northeast
5    1051  Northeast
6    1061  Northeast
7    1071  Northeast
8    1081  Northeast
9    1091  Northeast
10   1101  Northeast
11   1111  Northeast
12   1121  Northeast
13   1131  Northeast
14   1141  Northeast
15   1151  Northeast
16   1161  Northeast
17   1171  Northeast
18   1181  Northeast
19   1191  Northeast
20   1201  Northeast
21   1211  Northeast
22   1221  Northeast
23   1231  Northeast
24   1241  Northeast
25   1251  Northeast
26   1261  Northeast
27   1271  Northeast
28   1281  Northeast
29   1291  Northeast
..    ...        ...
321  4211       West
322  4221       West
323  4231       West
324  4241       West
325  4251       West
326  4261       West
327  4271       West
328  4281       West
329  4291       West
330  4301       West
331  4311       West
332  4321       West
333  4331       West
334  4341       West
335  4351       West
336  4361       West
337  4371       West
338  4381       West
339  4391       West
340  4401       West
341  4411       West
342  4421       West
343  4431       West
344  4441       West
345  4451       West
346  4461       West
347  4471       West
348  4481       West
349  4491       West
350  4501       West

[351 rows x 2 columns]

In [141]:
sql_query('SELECT DISTINCT id \
           FROM accounts;')

       id
0    1001
1    1011
2    1021
3    1031
4    1041
5    1051
6    1061
7    1071
8    1081
9    1091
10   1101
11   1111
12   1121
13   1131
14   1141
15   1151
16   1161
17   1171
18   1181
19   1191
20   1201
21   1211
22   1221
23   1231
24   1241
25   1251
26   1261
27   1271
28   1281
29   1291
..    ...
321  4211
322  4221
323  4231
324  4241
325  4251
326  4261
327  4271
328  4281
329  4291
330  4301
331  4311
332  4321
333  4331
334  4341
335  4351
336  4361
337  4371
338  4381
339  4391
340  4401
341  4411
342  4421
343  4431
344  4441
345  4451
346  4461
347  4471
348  4481
349  4491
350  4501

[351 rows x 1 columns]

Because each of these queries returned the same number of rows, we know that each ID is only associated with one region.

To more fully explain the process for each of these questions, what we are doing is counting the unique number of the required category (accounts) and then comparing them with their join to the other category (region). If the number of rows for the join matches the number of rows for the **DISTINCT** query, then there is only one per category level.

In [144]:
# 2 Have any sales reps worked more than one account?
sql_query('SELECT s.name rep, COUNT(a.name) num_accounts \
           FROM sales_reps s \
           JOIN accounts a \
           ON s.id = a.sales_rep_id \
           GROUP BY rep;')

                      rep  num_accounts
0         Akilah Drinkard             3
1         Arica Stoltzfus            10
2           Ayesha Monica             3
3          Babette Soukup             7
4            Brandie Riva            10
5          Calvin Ollison            11
6             Cara Clarke             4
7       Carletta Kosinski             5
8         Charles Bidwell             7
9             Chau Rowles             5
10           Cliff Meints             7
11         Cordell Rieder             3
12            Dawna Agnew             9
13         Debroah Wardle             6
14           Delilah Krum             8
15        Derrick Boggess             7
16        Dorotha Seawell            11
17      Earlie Schleusner            11
18            Elba Felder             6
19          Elna Condello             7
20           Elwood Shutt             9
21      Ernestine Pickron             3
22           Eugena Esser             6
23    Georgianna Chisholm            15
24          Gianna Dossey             7
25           Hilma Busick            10
26          Julia Behrman             8
27            Julie Starr             4
28       Kathleen Lalonde             4
29            Lavera Oles             4
30            Maren Musto            11
31      Marquetta Laycock             9
32    Maryanna Fiorentino            11
33         Micha Woodford            11
34        Michel Averette             7
35            Moon Torian            10
36           Nakesha Renn             3
37         Necole Victory             6
38            Nelle Meaux             7
39          Renetta Carew             4
40            Retha Sears             3
41          Samuel Racine             6
42              Saran Ram            10
43         Shawanda Selke             3
44  Sherlene Wetherington             5
45           Sibyl Lauria             6
46         Silvana Virden             3
47          Soraya Fulton             7
48              Tia Amato             8
49          Vernita Plump            11

This allows us to clearly see that each rep has more than one account.

In [143]:
sql_query('SELECT DISTINCT name \
           FROM sales_reps;')

                     name
0           Samuel Racine
1            Eugena Esser
2         Michel Averette
3           Renetta Carew
4             Cara Clarke
5             Lavera Oles
6             Elba Felder
7          Shawanda Selke
8            Sibyl Lauria
9          Necole Victory
10      Ernestine Pickron
11          Ayesha Monica
12            Retha Sears
13          Julia Behrman
14              Tia Amato
15        Akilah Drinkard
16         Silvana Virden
17           Nakesha Renn
18          Elna Condello
19          Gianna Dossey
20         Debroah Wardle
21  Sherlene Wetherington
22            Chau Rowles
23      Carletta Kosinski
24        Charles Bidwell
25           Cliff Meints
26           Delilah Krum
27       Kathleen Lalonde
28            Julie Starr
29         Cordell Rieder
30      Earlie Schleusner
31            Moon Torian
32        Dorotha Seawell
33            Maren Musto
34          Vernita Plump
35         Calvin Ollison
36              Saran Ram
37        Derrick Boggess
38         Babette Soukup
39            Nelle Meaux
40          Soraya Fulton
41           Brandie Riva
42      Marquetta Laycock
43           Hilma Busick
44        Arica Stoltzfus
45           Elwood Shutt
46    Maryanna Fiorentino
47    Georgianna Chisholm
48         Micha Woodford
49            Dawna Agnew

Because the number of rows match, we can confirm that all sales reps have been included. This also means that every rep has at least 1 account.

### Having
Because the **WHERE** clause does not allow you to filter by aggregate columns, we need an **HAVING**. We only use this when we are grouping by at least one column because otherwise the output is only one line. Often what is filtered with **HAVING** is done by subquery, but **HAVING** is cleaner.

While **WHERE** appears before **GROUP BY**, **HAVING** appears after it.

For an interesting addition to syntax, notice what is used for **GROUP BY** here:
```sql
SELECT account_id, SUM(total_amt_usd) AS sum_total_amt_usd
FROM orders
GROUP BY 1
HAVING sum_total_amt_usd >= 250000
```

1. How many of the sales reps have more than 5 accounts that they manage?
2. How many accounts have more than 20 orders?
3. Which account has the most orders?
4. How many accounts spent more than 30,000 usd total across all orders?
5. How many accounts spent less than 1,000 usd total across all orders?
6. Which account has spent the most with us?
7. Which account has spent the least with us?
8. Which accounts used facebook as a channel to contact customers more than 6 times?
9. Which account used facebook most as a channel? 
10. Which channel was most frequently used by most accounts?

In [145]:
# 1 How many of the sales reps have more than 5 accounts that they manage?
sql_query('SELECT s.name rep, \
                  COUNT(*) num_accounts \
           FROM sales_reps s \
           JOIN accounts a \
           ON s.id = a.sales_rep_id \
           GROUP BY rep \
           HAVING num_accounts > 5;')

                    rep  num_accounts
0       Arica Stoltzfus            10
1        Babette Soukup             7
2          Brandie Riva            10
3        Calvin Ollison            11
4       Charles Bidwell             7
5          Cliff Meints             7
6           Dawna Agnew             9
7        Debroah Wardle             6
8          Delilah Krum             8
9       Derrick Boggess             7
10      Dorotha Seawell            11
11    Earlie Schleusner            11
12          Elba Felder             6
13        Elna Condello             7
14         Elwood Shutt             9
15         Eugena Esser             6
16  Georgianna Chisholm            15
17        Gianna Dossey             7
18         Hilma Busick            10
19        Julia Behrman             8
20          Maren Musto            11
21    Marquetta Laycock             9
22  Maryanna Fiorentino            11
23       Micha Woodford            11
24      Michel Averette             7
25          Moon Torian            10
26       Necole Victory             6
27          Nelle Meaux             7
28        Samuel Racine             6
29            Saran Ram            10
30         Sibyl Lauria             6
31        Soraya Fulton             7
32            Tia Amato             8
33        Vernita Plump            11

We can see by the number of rows that the answer is 34. However, if the question is how many, as opposed to who, then this is most correctly answered with a subquery.

In [147]:
sql_query('SELECT COUNT(*) num_reps\
           FROM(SELECT s.name rep, \
                       COUNT(*) num_accounts \
                 FROM sales_reps s \
                 JOIN accounts a \
                 ON s.id = a.sales_rep_id \
                 GROUP BY rep \
                 HAVING num_accounts > 5) AS Table1;')

   num_reps
0        34

In [148]:
# 2 How many accounts have more than 20 orders?
sql_query('SELECT COUNT(*) num_accounts \
           FROM(SELECT a.name account, COUNT(o.id) count \
                FROM accounts a \
                JOIN orders o \
                ON a.id = o.account_id \
                GROUP BY account \
                HAVING count > 20) AS Table1;')

   num_accounts
0           120

In [149]:
# 3 Which account has the most orders?
sql_query('SELECT a.name, COUNT(o.id) num_orders \
           FROM orders o \
           JOIN accounts a \
           ON a.id = o.account_id \
           GROUP BY a.name \
           ORDER BY num_orders DESC\
           LIMIT 1;')

                name  num_orders
0  Leucadia National          71

In [153]:
# 4 How many accounts spent more than 30,000 usd total across all orders?
sql_query('SELECT COUNT(*) num_accounts \
           FROM(SELECT a.name, SUM(o.total_amt_usd) total_usd \
                FROM accounts a \
                JOIN orders o \
                ON a.id = o.account_id \
                GROUP BY a.name \
                HAVING total_usd > 30000) AS Table1;')

   num_accounts
0           204

In [154]:
# 5 How many accounts spent less than 1,000 usd total across all orders?
sql_query('SELECT COUNT(*) num_accounts \
           FROM(SELECT a.name, SUM(o.total_amt_usd) total_usd \
                FROM accounts a \
                JOIN orders o \
                ON a.id = o.account_id \
                GROUP BY a.name \
                HAVING total_usd < 1000) AS Table1;')

   num_accounts
0             3

In [155]:
# 6 Which account has spent the most with us?
sql_query('SELECT a.name account, SUM(o.total_amt_usd) total_usd\
           FROM accounts a \
           JOIN orders o \
           ON a.id = o.account_id \
           GROUP BY account \
           ORDER BY total_usd DESC \
           LIMIT 1;')

         account  total_usd
0  EOG Resources   382873.3

If you just wanted to return the channel and not the count, then you would use a subquery.

In [161]:
sql_query('SELECT account \
           FROM(SELECT a.name account, SUM(o.total_amt_usd) total_usd\
                FROM accounts a \
                JOIN orders o \
                ON a.id = o.account_id \
                GROUP BY account \
                ORDER BY total_usd DESC \
                LIMIT 1) AS Table1;')

         account
0  EOG Resources

In [156]:
# 7 Which account has spent the least with us?
sql_query('SELECT a.name account, SUM(o.total_amt_usd) total_usd\
           FROM accounts a \
           JOIN orders o \
           ON a.id = o.account_id \
           GROUP BY account \
           ORDER BY total_usd \
           LIMIT 1;')

  account  total_usd
0    Nike     390.25

In [157]:
# 8 Which accounts used facebook as a channel to contact customers more than 
#   6 times?
sql_query('SELECT a.name account, w.channel, COUNT(*) count\
           FROM accounts a \
           JOIN web_events w \
           ON a.id = w.account_id \
           GROUP BY 1, 2 \
           HAVING count > 6 AND w.channel = "facebook";')

                                account   channel  count
0                                   ADP  facebook      9
1                                 Aetna  facebook     10
2                                 Apple  facebook      9
3                     Arrow Electronics  facebook      9
4                            AutoNation  facebook     14
5                     Avis Budget Group  facebook      7
6                              Best Buy  facebook      7
7                             BlackRock  facebook     10
8                            CST Brands  facebook      9
9                 Cameron International  facebook      9
10               Charter Communications  facebook     13
11                        Cisco Systems  facebook      8
12                    Colgate-Palmolive  facebook     10
13                    Core-Mark Holding  facebook      8
14                               Disney  facebook     12
15                       Dollar General  facebook      9
16                        EOG Resources  facebook     11
17                               Ecolab  facebook     11
18           Farmers Insurance Exchange  facebook      7
19                          FirstEnergy  facebook     10
20                                Fluor  facebook      8
21                     General Dynamics  facebook      8
22                        General Mills  facebook      9
23                      Gilead Sciences  facebook     16
24                           Home Depot  facebook      7
25              Honeywell International  facebook      7
26                    J.P. Morgan Chase  facebook      7
27                        Kinder Morgan  facebook      9
28          Laboratory Corp. of America  facebook      7
29                    Leucadia National  facebook      7
30                        Lithia Motors  facebook     10
31                   Marathon Petroleum  facebook     12
32  Massachusetts Mutual Life Insurance  facebook      9
33                               Mosaic  facebook     10
34              New York Life Insurance  facebook     10
35                                  PPL  facebook      8
36                               Paccar  facebook      8
37                      Parker-Hannifin  facebook      7
38                      PayPal Holdings  facebook      8
39          Philip Morris International  facebook     12
40                   Southwest Airlines  facebook      9
41                                  TJX  facebook     15
42          United Continental Holdings  facebook     11
43             Walgreens Boots Alliance  facebook     10
44                          Wells Fargo  facebook      7
45                                 eBay  facebook      7

In [158]:
# 9 Which account used facebook most as a channel?
sql_query('SELECT a.name account, w.channel, COUNT(*) count \
           FROM accounts a \
           JOIN web_events w \
           ON a.id = w.account_id \
           GROUP BY 1, 2 \
           HAVING w.channel = "facebook" \
           ORDER BY count DESC \
           LIMIT 1;')

           account   channel  count
0  Gilead Sciences  facebook     16

This works if there were no ties, and it is better to use a limit of 3 or 5 first to double check.

In [162]:
# 10 Which channel was most frequently used by most accounts?
sql_query('SELECT a.name, w.channel, COUNT(*) count\
           FROM web_events w \
           JOIN accounts a \
           ON w.account_id = a.id \
           GROUP BY 1, 2 \
           ORDER BY count DESC\
           LIMIT 10;')

                          name channel  count
0            Leucadia National  direct     52
1            Colgate-Palmolive  direct     51
2      New York Life Insurance  direct     51
3  Philip Morris International  direct     49
4                          ADP  direct     48
5                   AutoNation  direct     48
6                    BlackRock  direct     48
7       Charter Communications  direct     48
8                  FirstEnergy  direct     48
9                 Altria Group  direct     47